Repository: vexl-it/vexl-ios
Catalog: vexl/Resources/*.lproj/Localizable.strings
Languages: cs, sk

# terms.of.use.markdown
source: 1. **WELCOME** We would like to thank you for your choice to use Vexl. We know that you are eager to go ahead and start using it right away, but we kindly ask you to spare a few minutes to read through the Terms of Service first. We value your time, so we promise that we will keep it as brief as possible. If you agree with everything that you read here, you may then go ahead and start using Vexl. 2. **PARTIES** Let's start with introductions, so you know, who hides under the terms “we” and “you” frequently used throughout this document. We are a commercial company Vexl s.r.o. with a registered office at Kundratka 2359/17a, Libeň, 180 00 Prague 8, Czech Republic. While this is probably sufficient information for you, law dictates that we must also mention that our Id. No. is 172 70 642 and we are registered in the commercial register kept by the Commercial court in Prague under file No. 369216. By “you” we mean anybody, whether you are an individual or legal person, who uses Vexl in any way. It probably goes without saying, but your legal capacity must not be limited to the extent that it could prevent you from accepting these Terms of Service and using Vexl. To make things simpler, let's just agree that you must be at least 18 years old to use Vexl. 3. **ABOUT VEXL** To put it simply, Vexl is a service (which includes an application) that allows users interested in buying or selling Bitcoin to connect with each other to discuss their offers and agree upon trades. What is more, Vexl accomplishes that while collecting and storing almost no information about the users. Once the users are connected they may discuss the potential trade via private and secure (end-to-end encrypted) chat. **Important notice: Vexl itself does not offer any instruments to facilitate Bitcoin transactions between the users. We do not monitor whether any trades took place between any of our users. The only objective of Vexl is to provide the users a safe and simple to use platform for finding and contacting each other and for discussing the terms of the trade.** For the reasons above we also cannot issue any confirmation of the transactions between the users and we most definitely cannot issue any invoice on behalf of the users. If you need any such confirmation, you must communicate such a request to the other party of your trade. 4. **USER ACCOUNT** To keep your user account secure and private, we decided on a new approach. Instead of creating a conventional user account and storing all the related data on our servers, we decided that most sensitive data will be stored locally on your device and that your user account will be only accessible with a so-called private key generated and stored by Vexl locally on your device as part of the onboarding procedure. This is very important, because it means that your account can only be accessed from your device and once the private key is deleted, no one can access the user account. **Important notice: Your private key is essential to access your user account and related data. If you lose your phone, format your phone´s hard drive, uninstall Vexl, or even just decide to logout from Vexl, your private key will be lost, and your original user account including any related data cannot be recovered.** To create your user account, we verify your phone number by sending you a verification code. You agree to receive text messages (from us or our third-party providers) with verification codes to complete the onboarding procedure and you agree that you are authorized to use the phone number for such purpose. Although you do not have to set up a password to access Vexl, we strongly recommend doing so. When choosing your password, we also recommend not to reuse passwords used in third-party applications. Changing the password frequently to keep your user account secure may also be a good idea. Alternatively, you can also set up FaceID to access Vexl. The user account is dedicated to you, and you are responsible for all activities that occur on or through the user account, so it is important that you keep your password and devices used to access the user account secure. This does not only protect you, but also any other users of Vexl that have no way of knowing who is actually logged into your Vexl account. 5. **USER CONTACTS** Vexl only allows you to connect with your friends (1st degree contacts) or with people that you have a common friend with (2nd degree contacts). Therefore, as a part of the onboarding procedure, you will be asked to import the contact details of your friends either from your phone address book so that Vexl can cross check your contact database against the contact information of our current users. This does not allow Vexl to make any changes to the contact list on your phone. The contact details will then remain stored encrypted in a separate microservice dedicated only for handling contact lists and inaccessible by us. **Important notice: As with other data, the contact information will be encrypted by Vexl locally on your device, so we cannot read it, when it is transmitted into our microservice. We look for your 1st and 2nd degree contacts solely by comparing the encrypted data (hashes) with each other without having to know the actual underlying contact information.** 6. **OFFERS AND CHAT** Publishing offers to buy or sell Bitcoin and facilitating the connection with the users interested in such offers is the main functionality of Vexl. Depending on the parameters of the offer, it is visible either only to your 1st degree contacts, or also to the 2nd degree contacts. The offer is encrypted for respective users using their public keys, so that no other user can see it. **Important notice: The users do not know the identity of the offering user until the offering user actively reveals it. However, they do see anonymous information about the link between the users (such as how many common friends there are etc.).** The user may request to be connected with the user making the offer. If a connection is accepted by the user making the offer, a chat is started between the users. Within the chat, the users may require each other to reveal their identity. This is absolutely voluntary and you can always decline. Once you reveal your identity, it can't be taken back. The messages within the chat are transmitted in encrypted form using the public keys of both users participating in the chat. The messages are stored locally on the phones of both users, where they may be decrypted using their respective private keys. We solely transmit the messages between the users and do not permanently store them on our servers (and even if we did, we could not read them anyway as they are encrypted). **Important notice: The chat messages are not backed up by us. Once the chat is closed the messages cannot be recovered. If you agree on any important details with the other user regarding your trade, we recommend not to close the chat until the trade is successfully settled.** 7. **PERSONAL DATA** Let us assure you that the collection of your personal data (e.g. the data submitted when creating your user account) in connection to using Vexl will be as limited as possible. Most information is stored locally and transmitted to other users in an encrypted form, so we cannot read it even if we wanted to. If any collection, storage and handling of your personal data actually happens, it will be always transparently described in a separate set of terms on handling the personal data of Vexl users (Vexl Privacy Policy) that you will be asked to agree with in the next step of the onboarding procedure. 8. **APPLICATION AND LICENSES** Vexl application represents the only way to access Vexl services, so it is an integral part of Vexl. From time to time, our Vexl application may be updated. In such cases, we will usually let you know via a pop up window in the application that a new update is available. You agree to always update the application before any further use thereof to ensure a correct functionality. The use of Vexl application is governed by the GNU General Public License version 3 (GPLv3). Please, keep in mind that we may also license Vexl application or any part thereof under a proprietary license. Notwithstanding anything in these Terms of Service, we retain ownership of all copyrights, trademarks, logos, patents, and other intellectual property rights associated with Vexl. 9. **CODE OF CONDUCT** **Conduct towards other users** As you know by now, Vexl allows you to communicate with other users. Even though we solely transmit the encrypted communication between the users and have no way of reviewing it, we still ask you to maintain a proper standard of conduct. We believe our users understand what we mean when we say a proper standard of conduct and while we would like to leave it at that, law dictates that we must be more precise, so let's get it over with: **You must not (i)** misappropriate or infringe the rights of other users, including privacy, publicity, intellectual property, or other proprietary rights; **(ii)** send to other users any content that is illegal, obscene, defamatory, threatening, intimidating, harassing, hateful, racially or ethnically offensive, or encourage a conduct that would be illegal or otherwise inappropriate; **(iii)** send to other users any false or misleading information; (iv) impersonate others when communicating with other users; or (v) send to other users viruses or other harmful computer code. **Conduct towards us** Also, we ask you to be respectful to us and do not use Vexl for any unlawful activities or in any way that could harm us. Again, we would like to leave it at that, but law dictates us to be more precise, so let's again list the sufficient detail: **You must not (i)** use Vexl other than for legal, authorized, and acceptable purposes in accordance with these Terms of Service, **(ii)** access, use, modify, distribute, or exploit Vexl in ways that could harm us (introduction of viruses or other malicious or harmful material, attempting to gain unauthorized access to our systems, disrupt integrity of Vexl etc.), **(iii)** misappropriate or infringe the rights of our company, including intellectual property or other proprietary rights. **Breach of representations** If you represent or agree with something in these Terms of Service, we take your word for it, so if we later learn that any of your representations hereunder were false, it is considered as a breach of these Terms of Service. 10. **REPORTING VIOLATIONS** If you find that any content within Vexl violates your intellectual property rights, moral rights (including rights to privacy and portrait) or can be considered as any other violation of any applicable law or these Terms of Service, please, report the violation via the email address: [support@vexl.it](mailto:support@vexl.it). We may request additional information and/or materials (such as your personal information and evidence of the violation) necessary to assess your report and in such case, you agree to fully cooperate with our additional requests. It goes without saying that the report can only be assessed by us, if you fully cooperate and provide any requested materials and/or information. Please note, that even if the violation occurs and is reported, we have only very limited tools to take down any of the content within Vexl, since the content is stored locally on users´ devices (and we absolutely cannot browse them in search of any harmful content; moreover the content is encrypted) and is only transmitted between users in encrypted form (and can be decrypted only by the users, to which it is addressed, not by us). 11. **AVAILABILITY** We always attempt to provide continuous uninterrupted operation of our services, so you can access and use Vexl at any time. However, due to maintenance, repairs, exceptional outages or for other reasons, there may be occasions when Vexl will not be available. Therefore, we cannot always guarantee completely uninterrupted availability. 12. **LIABILITY AND WARRANTY LIMITATION** To summarize: - Vexl is provided to you on as is and where available basis without any warranties. - We are not liable for any damages in relation to your use or inability to use Vexl. - We are not responsible for any breach of terms agreed between the users via Vexl. In more detail: We have created Vexl and we operate it using a reasonable level of skill and care and we hope that you will enjoy using it; however, be aware that it is still offered to you on an as is and where-available basis and, therefore, we expressly disclaim any warranties, express or implied, relating thereto. We are not under any circumstances to be held liable for any direct, indirect, special, consequential, punitive or any other damages and costs including, but not limited to, loss of profit, loss of revenue or loss of a business opportunity arising out of or in connection with your access and use or inability to access and use Vexl. Furthermore, you hereby waive to the fullest extent permitted under any applicable law any claims for damages that you may have against us in relation to your use of Vexl or inability to use it. You specifically waive the damages incurred in relation to any trades agreed upon with other users of Vexl. You are solely responsible for data and mobile carrier fees and taxes associated with the devices on which you use Vexl. If the warranties and liabilities disclaimers above are found void or invalid or otherwise unenforceable, you agree that our total liability for any claims arising out of these Terms of Service or in relation thereto are limited to the fullest extent permitted by the applicable law. 13: **FINANCIAL RISKS** Even though trades between our users are none of our business, as we have repeatedly stated, we still feel obliged to provide you with advice about potential cryptocurrency related risks (well it is more that law dictates us to do so). First things first: Under no circumstances can any information within Vexl constitute financial, investment or professional advice, unless explicitly stated so. You are solely responsible for your decisions regarding storing, buying, selling, exchanging, sending and receiving Bitcoin and you must always consider your financial circumstances and associated risks before obtaining Bitcoin. You represent that you understand all the risks involved in purchasing, selling and exchanging Bitcoin including the fact that Bitcoin transactions are irreversible. You represent that you understand that the value of Bitcoin may be extremely volatile and that its exchange rate in respect to other cryptocurrencies or to fiat currencies may fluctuate significantly, which could lead to significant and sudden decreases in the value of your assets. You hereby acknowledge, that you are solely responsible for obtaining the necessary information about tax or similar obligations arising in relation to any submitted transactions and for withholding, collecting, reporting and remitting the correct amounts of tax to the appropriate tax authorities. You acknowledge that not all the associated risks of using cryptocurrencies are identified in these Terms of Service. **Important notice: Vexl displays the current price of Bitcoin for users´ convenience. However, there is no universally accepted price of Bitcoin and prices usually differ across various cryptocurrency exchanges. In Vexl we show you the average price of Bitcoin provided by CoinGecko ([https://coingecko.com](https://coingecko.com)).** 14. **TERMINATION** We will always be sorry to see you go, but if you decide not to use Vexl anymore we will respect your decision. Your user account can be deleted quite easily, by tapping on the “logout” button under the user account interface. After logging out no data related to the original user account can be recovered. **Important notice: If you decide to log out, please be careful, as logging out will effectively delete your user account. Such action is irreversible, so if you decide to use Vexl again in the future, you will not be able to recover any data linked to your original user account and you will have to go through the same onboarding procedure as any new user.** We also specifically reserve a right to suspend or permanently deny an access to Vexl for users located in certain countries or for nationals of certain countries mainly for regulatory reasons (we can identify your location or nationality also indirectly for example from a country code, app store, or your phone number). Finally, we also reserve a right to discontinue Vexl completely. In that event, we will give you at least thirty (30) days prior notice. After that we will be free to discontinue Vexl and you will not be able to access your user account anymore. 15. **NOTICES** **Your messages to us:** You can contact us electronically via tools available on our website or via the email address [support@vexl.it](mailto:support@vexl.it) Your message is considered as delivered when we confirm its delivery to you, which we always attempt to do promptly. **Our messages to you:** We will not bother you too much, but occasionally we may have to contact you. In that event we will use a push notification available to you upon logging into your user account. 16. **APPLICABLE LAW** Your use of Vexl as well as these Terms of Service and any issues related thereto including any disputes between you and us are governed by the laws of the Czech Republic, without regard to conflict of laws principles. For consumers only: We are obliged to inform you that this choice of law clause does not deprive you, if you're a consumer of your rights under mandatory provisions of the law of your country of habitual residence in the event that such law would otherwise be applicable pursuant to the Article 6 (1) Regulation (EC) No 593/2008 of the European Parliament and of the Council of 17 June 2008 on the law applicable to contractual obligations (Rome I). 17. **DISPUTE RESOLUTION** We always try to solve any issues peacefully and ask you to do the same. Therefore, you agree to notify us of any disputes arising out of or in connection with these Terms of Service and you agree that you will always attempt an out-of-court dispute resolution before you bring the dispute before the courts. However, sometimes out-of-court dispute resolution is just not possible. In that event, any dispute relating in any way to these Terms of Services shall be decided with final effect before the courts of the Czech Republic exercising jurisdiction over the place of registered business of our company. **For consumers only:** We are obliged to inform you that in the event of any disputes, you have the right to seek an out-of-court settlement through the Czech Telecommunication Office with its registered office at Sokolovská 219, Prague 9, Id. No. 701 06 975, web address ([https://www.ctu.eu/out-court-dispute-resolution](https://www.ctu.eu/out-court-dispute-resolution)) for disputes regarding electronic communications, and through the Czech Trade Inspection Authority with its registered office at Štěpánská 567/15, 120 00 Prague 2, Id. No. 000 20 869, web address [https://adr.coi.cz/cs](https://adr.coi.cz/cs) for any other disputes. You may also use a platform for out-of-court dispute settlement located on the website [http://ec.europa.eu/consumer/odr](http://ec.europa.eu/consumer/odr). 18. **CHANGES** **Operator**: You agree to any future change of the operator of Vexl services under these Terms of Service (assignment of the contract established by these Terms of Service). In case of such change, we will always notify you. **Terms of Service**: We may change or amend these Terms of Services or an additional term that apply to Vexl (such as Privacy Policy) from time to time, and if we do so, we will have to ask you to read through them and agree to them again. We realize it's inconvenient for you, so we promise not to do it too often. Your continued use of Vexl confirms your acceptance of our updated Terms of Service.
cs: # Just testing markdown [link](https://google.com) ## Team * **Name Surname** - work position * **Name Surname** - work position
sk: 1. **VÍTEJTE** Rádi bychom Vám poděkovali, že jste se rozhodli používat právě Vexl. Víme, že se už nemůžete dočkat, až se do něj poprvé přihlásíte, ale ještě před tím bychom Vás rádi požádali, abyste nám věnovali několik minut Vašeho času a přečetli si tyto Smluvní podmínky. Víme, že Váš čas je cenný, a proto slibujeme, že naše dokumenty budou vždy maximálně stručné. Pokud souhlasíte se vším, co jste si zde přečetli, můžete se pustit do používání Vexlu. 2. **SMLUVNÍ STRANY** Nejprve se pojďme vzájemně představit, abyste věděli, kdo se skrývá pod pojmy "my" a "Vy", které se v tomto dokumentu často vyskytují. „My“ jsme obchodní společnost Vexl s.r.o. se sídlem Kundratka 2359/17a, Libeň, 180 00 Praha 8, Česká Republika. Toto by pro Vás pravděpodobně byla dostatečná informace, zákon nám však ukládá, abychom ještě uvedli, že naše identifikační číslo (IČO) je 172 70 642 a že jsme zapsáni v obchodním rejstříku vedeném Městským soudem v Praze, oddíl C, vložka 369216. Pojmem „Vy“ máme na mysli kohokoliv, kdo Vexl jakýmkoliv způsobem používá, nehledě na to, zda jste fyzická nebo právnická osoba. Asi je to samozřejmé, ale Vaše svéprávnost (způsobilost právně jednat) nesmí být omezena do té míry, že by Vám to mohlo bránit v souhlasu s těmito Smluvními podmínkami a používání Vexlu. Pro zjednodušení se zkrátka dohodněme, že pro používání Vexlu Vám musí být alespoň 18 let. 3. **CO JE VEXL?** Zjednodušeně řečeno, Vexl je služba (jejíž součástí je aplikace), která umožňuje uživatelům se zájmem o nákup nebo prodej Bitcoinu navázat spojení, diskutovat o svých nabídkách a dohodnout se na obchodech. A co víc, Vexl během celého procesu o uživatelích neshromažďuje a neukládá téměř žádné informace. Jakmile se uživatelé propojí, mohou o možném obchodu komunikovat prostřednictvím soukromého zabezpečeného (end-to-end šifrováním) chatu. **Důležité upozornění: Vexl jako takový neobsahuje žádné nástroje, které by uživatelům umožňovaly provádět transakce Bitcoinu. Zároveň Vexl ani nesleduje, zda mezi některými z našich uživatelů vůbec došlo k obchodům s Bitcoinem. Jediným účelem Vexlu je poskytnout uživatelům bezpečnou a snadno použitelnou platformu, na které se mohou vzájemně vyhledat, kontaktovat a projednat podmínky případného obchodu.** Z výše uvedených důvodů také nemůžeme vydávat žádná potvrzení o transakcích mezi uživateli a rozhodně nemůžeme jménem uživatelů vystavovat žádné faktury. Pokud takové potvrzení potřebujete, musíte svůj požadavek sdělit uživateli, se kterým obchodujete. 4. **UŽIVATELSKÝ ÚČET** Abychom zajistili bezpečnost a soukromí Vašeho uživatelského účtu, rozhodli jsme se pro zcela inovativní přístup. Namísto vytváření běžného uživatelského účtu a ukládání všech souvisejících dat na našich serverech jsme se rozhodli, že většina citlivých dat bude uložena lokálně ve Vašem zařízení a že Váš uživatelský účet bude přístupný pouze s pomocí takzvaného privátního klíče, který Vexl vygeneruje a uloží lokálně ve Vašem zařízení při vytvoření uživatelského účtu. To znamená, že Váš účet je přístupný pouze z Vašeho zařízení a jakmile je privátní klíč vymazán, nikdo včetně Vás se k uživatelskému účtu nebude moci přihlásit. Důležité upozornění: Váš privátní klíč je nezbytný pro přístup k uživatelskému účtu a souvisejícím datům. Pokud ztratíte svůj mobilní telefon, formátujete disk Vašeho mobilního telefonu, odinstalujete aplikaci Vexl nebo se dokonce jen rozhodnete z aplikace Vexl odhlásit, Váš privátní klíč bude ztracen a Váš původní uživatelský účet včetně všech souvisejících dat nebude možné obnovit. Při vytvoření Vašeho uživatelského účtu ověříme Vaše telefonní číslo zasláním ověřovacího kódu. Souhlasíte s tím, že obdržíte SMS zprávu (od nás nebo od našich externích partnerů) s ověřovacími kódy pro dokončení procesu registrace a potvrzujete, že jste pro tento účel oprávněni dané telefonní číslo používat. Ačkoli si pro přístup k Vexlu nemusíte nastavovat heslo, důrazně doporučujeme to udělat. Při volbě hesla také doporučujeme nepoužívat znovu hesla používaná v jiných aplikacích. Dobrým nápadem, jak udržet svůj uživatelský účet v bezpečí, může být také častá změna hesla. Pro přístup k aplikaci Vexl si můžete případně také nastavit FaceID. Uživatelský účet je určen pouze Vám a Vy jste tedy odpovědní za všechny činnosti, které se na něm nebo jeho prostřednictvím odehrávají, proto je důležité, abyste své heslo a zařízení používaná k přístupu k uživatelskému účtu zabezpečili. Tím chráníte nejen sebe, ale i všechny ostatní uživatele Vexlu, kteří nemají možnost zjistit, kdo je skutečně přihlášen k Vašemu uživatelskému účtu. 5. **KONTAKTY UŽIVATELE** Vexl Vám umožňuje spojit se pouze s Vašimi přáteli (kontakty 1. stupně) nebo s lidmi, se kterými máte společného přítele (kontakty 2. stupně). Proto budete v rámci procesu registrace požádáni o import kontaktních údajů Vašich přátel, buď z adresáře Vašeho mobilního telefonu, aby Vexl mohl porovnat Vaši databázi kontaktů s kontaktními údaji našich současných uživatelů. Vexl přitom nemůže provádět jakékoliv změny v seznamu kontaktů ve Vašem mobilním telefonu. Kontaktní údaje poté zůstanou uloženy zašifrované (a pro nás tedy nečitelné) v naší samostatné mikroslužbě určené pouze pro ukládání těchto zašifrovaných seznamů kontaktů. Důležité upozornění: Stejně jako u ostatních údajů budou kontaktní údaje zašifrovány Vexlem lokálně ve Vašem zařízení a pro nás jsou tedy nečitelné. Vaše kontakty 1. a 2. stupně vyhledáváme výhradně vzájemným porovnáním zašifrovaných dat (hashů), aniž bychom museli znát podkladové kontaktní údaje. 6. **NABÍDKY A CHAT** Hlavní funkcí Vexlu je zveřejňování nabídek na nákup nebo prodej Bitcoinu a zprostředkování kontaktu mezi uživateli, kteří mají o tyto nabídky zájem. V závislosti na parametrech nabídky je tato viditelná buď pro kontakty 1. stupně nebo pro kontakty 2. stupně. Nabídka je pro dané uživatele zašifrována pomocí jejich veřejných klíčů, takže ji žádný jiný uživatelé nevidí. **Důležité upozornění: Uživatelé neznají identitu nabízejícího, dokud ji nabízející sám aktivně neprozradí. Vidí však anonymní informace o vzájemném spojení (například kolik mají společných přátel atd.)** Uživatel může požádat o propojení s uživatelem, který činí nabídku. Pokud uživatel, který nabídku učinil, spojení přijme, zahájí se mezi uživateli chat. V rámci tohoto chatu mohou uživatelé požadovat, aby si navzájem prozradili svou identitu. Toto je zcela dobrovolné a vždy můžete odmítnout. Odhalení identity je nevratné. Zprávy v rámci chatu jsou zašifrované pomocí veřejných klíčů obou uživatelů, kteří se chatu účastní. Zprávy jsou uloženy lokálně v mobilních telefonech obou uživatelů, kde je lze dešifrovat pomocí jejich soukromých klíčů. Z naší strany zprávy pouze přenášíme a neukládáme je trvale na naše servery (vedle toho i kdybychom je ukládali, nemohli bychom je přečíst, protože jsou zašifrované). **Důležité upozornění: Zprávy v chatu nejsou z naší strany zálohovány. Po ukončení chatu nelze zprávy obnovit. Pokud se s druhým uživatelem dohodnete na důležitých detailech týkajících se Vašeho obchodu, doporučujeme chat neukončovat, dokud není obchod úspěšně dokončen.** 7. **OSOBNÍ ÚDAJE** Rádi bychom Vás ubezpečili, že shromažďování Vašich osobních údajů (např. údajů poskytnutých při vytváření uživatelského účtu) v souvislosti s používáním Vexlu je maximálně omezeno. Většina informací se ukládá lokálně a ostatním uživatelům se přenášejí v zašifrované podobě, takže je navíc nemůžeme přečíst ani kdybychom chtěli. Pokud k nějakému shromažďování, ukládání a nakládání s Vašimi osobními údaji skutečně dojde, bude to vždy transparentně popsáno v samostatném souboru podmínek pro nakládání s osobními údaji uživatelů Vexl (Zásady ochrany osobních údajů Vexl), k souhlasu s nimiž budete v dalším kroku procesu registrace vyzváni. 8. **APLIKACE A LICENCE** Aplikace Vexl představuje jediný způsob přístupu ke službám Vexl, a je tedy nedílnou součástí Vexlu. Aplikace může být čas od času aktualizována. V takových případech Vás obvykle prostřednictvím vyskakovacího okna v aplikaci informujeme, že je k dispozici nová aktualizace. Před dalším používáním aplikaci musíte vždy aplikaci aktualizovat, aby byla zajištěna její správná funkčnost. Používání aplikace Vexl se řídí licencí GNU General Public License verze 3 (GPLv3). Mějte prosím na paměti, že aplikaci Vexl nebo její část můžeme licencovat také pod jinou vlastní (např. uzavřenou) licencí. Bez ohledu na cokoli uvedené v těchto Smluvních podmínkách si vyhrazujeme vlastnictví všech autorských práv, ochranných známek, log, patentů a dalších práv duševního vlastnictví spojených s Vexlem. 9. **KODEX CHOVÁNÍ** **Chování vůči ostatním uživatelům** Jak už víte, Vexl Vám umožňuje komunikovat s ostatními uživateli. Přestože komunikaci mezi uživateli přenášíme výhradně v zašifrované podobě a nemáme možnost ji kontrolovat, žádáme Vás, abyste zachovávali určité standardy chování. Věříme, že naši uživatelé chápou, co tím máme na mysli, a přestože bychom to rádi nechali tak, zákon nám ukládá, abychom byli konkrétnější, takže si to pojďme říct: **Nesmíte (i)** zneužívat nebo porušovat práva jiných uživatelů, včetně práv na soukromí, práva na ochranu osobnosti, práva duševního vlastnictví nebo jiná vlastnická práva; **(ii)** posílat jiným uživatelům obsah, který je nezákonný, obscénní, hanlivý, výhružný, zastrašující, obtěžující, nenávistný, rasově nebo etnicky urážlivý, nebo podněcovat k jednání, které by bylo nezákonné nebo jinak nevhodné; **(iii)** zasílat ostatním uživatelům jakékoli nepravdivé nebo zavádějící informace; **(iv)** vydávat se při komunikaci s ostatními uživateli za jiné osoby; nebo **(v)** zasílat ostatním uživatelům viry nebo jiné škodlivé počítačové kódy. **Chování vůči nám** Současně Vás žádáme, abyste k nám byli ohleduplní a nepoužívali Vexl k nezákonným aktivitám nebo způsobem, který by nás mohl poškodit. Opět bychom to nejraději nechali takto, ale zákon nám ukládá, abychom byli konkrétnější, takže si opět pojďme uvést dostatečné podrobnosti: **Nesmíte (i)** používat Vexl jinak než k zákonným, oprávněným a přijatelným účelům v souladu s těmito Smluvními podmínkami, **(ii)** zpřístupňovat, používat, upravovat, distribuovat nebo zneužít Vexl způsobem, který by nás mohl poškodit (šíření virů nebo jiného nežádoucího či škodlivého obsahu, pokus o získání neoprávněného přístupu do našich systémů, narušení integrity Vexl atd.), **(iii)** zneužívat nebo porušovat práva naší společnosti, včetně práv duševního vlastnictví nebo jiných vlastnických práv. **Porušení prohlášení** Pokud v těchto Smluvních podmínkách něco prohlásíte nebo s něčím souhlasíte, bereme Vás za slovo, takže pokud se později dozvíme, že některé z Vašich prohlášení podle těchto Smluvních podmínek bylo nepravdivé, budeme to považovat za porušení těchto Smluvních podmínek. 10. **HLÁŠENÍ PORUŠENÍ** Pokud zjistíte, že jakýkoli obsah v rámci Vexlu porušuje Vaše práva duševního vlastnictví, osobnostní práva (včetně práva na soukromí a práva na zachycení a šíření podoby) nebo může být považován za jakékoli jiné porušení platných právních předpisů nebo těchto Podmínek služby, ohlaste, prosím, toto porušení prostřednictvím e-mailové adresy: [support@vexl.it](mailto:support@vexl.it). Můžeme si vyžádat další informace a/nebo podklady (například Vaše osobní údaje a důkazy o porušení) potřebné k posouzení Vašeho oznámení a v takovém případě souhlasíte s tím, že budete poskytovat plnou součinnost s našimi dalšími požadavky. Je samozřejmostí, že jakákoliv ohlášení můžeme posoudit pouze v případě, že budete plně spolupracovat a poskytnete nám veškeré požadované podklady a/nebo informace. Vezměte prosím na vědomí, že i v případě, že k porušení dojde a je ohlášeno, máme jen velmi omezené nástroje k odstranění jakéhokoli obsahu v rámci Vexlu, protože obsah je uložen lokálně v zařízeních uživatelů (a my je rozhodně nemůžeme procházet a hledat v nich jakýkoli škodlivý obsah; obsah je navíc zašifrovaný) a je mezi uživateli přenášen pouze v zašifrované podobě (a dešifrovat jej mohou pouze uživatelé, kterým je určen, nikoli my). 11. **DOSTUPNOST** Vždy se snažíme zajistit nepřetržitý a nepřerušovaný provoz našich služeb, abyste měli k Vexlu přístup a mohli jej kdykoli užívat. Nicméně z důvodu údržby, oprav, výjimečných výpadků nebo z jiných důvodů se může stát, že Vexl nebude dostupný. Proto nemůžeme vždy zaručit zcela nepřetržitou dostupnost. 12. **ODPOVĚDNOST A OMEZENÍ ZÁRUKY** V krátkosti: - Vexl je Vám poskytován na as is a where available bázi bez jakýchkoli záruk. - Neodpovídáme za žádné škody vzniklé v souvislosti s Vaším používáním nebo nemožností používat Vexl. - Neneseme odpovědnost za porušení podmínek dohodnutých mezi uživateli prostřednictvím Vexl. Podrobněji: Vexl jsme vytvořili a provozujeme s přiměřenou úrovní odbornosti a péče a doufáme, že se Vám jeho užívání bude líbit; nicméně mějte na paměti, že je vám stále nabízen tak, jak je (as is) a bez garance dostupnosti (where available), a proto se výslovně zříkáme jakýchkoli záruk, výslovných nebo předpokládaných, které se k tomuto vztahují. Za žádných okolností neneseme odpovědnost za jakékoli přímé, nepřímé, zvláštní, následné, sankční nebo jakékoli jiné škody a náklady, zahrnující, mimo jiné, ušlý zisk, ztrátu příjmů nebo ztrátu obchodní příležitosti, které vznikly v důsledku nebo v souvislosti s Vaším přístupem a užíváním nebo nemožností přístupu a užívání Vexlu. Dále se tímto v plném rozsahu přípustném dle jakýchkoliv platných právních předpisů vzdáváte jakýchkoliv nároků na náhradu škody, které byste vůči nám mohli mít v souvislosti s užíváním Vexlu nebo nemožností jej užívat. Výslovně se vzdáváte nároku na náhradu škody vzniklé v souvislosti s jakýmikoliv obchody sjednanými s jinými uživateli Vexl. Nesete výhradní odpovědnost za údaje a poplatky mobilního operátora a daně spojené se zařízeními, na kterých používáte Vexl. Pokud budou výše uvedená omezení záruk a odpovědnosti shledána neplatnými nebo neúčinnými nebo jinak nevymahatelnými, souhlasíte s tím, že naše celková odpovědnost za jakékoli nároky vyplývající z těchto Smluvních podmínek nebo s nimi související je omezena v nejvyšším rozsahu povoleném příslušnými právními předpisy. 13. **FINANČNÍ RIZIKA** I když nám do obchodování mezi našimi uživateli nic není, jak jsme v těchto Smluvních podmínkách opakovaně uvedli, přesto se cítíme povinni poskytnout Vám poučení o možných rizicích souvisejících s kryptoměnami (abychom byli upřímní, spíše nám to ukládá zákon). Takže popořadě: V žádném případě nemohou žádné informace v rámci Vexlu představovat finanční, investiční nebo odborné poradenství, pokud to není výslovně uvedeno. Za svá rozhodnutí týkající se ukládání, nákupu, prodeje, směny, zasílání a přijímání Bitcoinu nesete výhradní odpovědnost Vy a vždy musíte před pořízením Bitcoinu zvážit svou finanční situaci a související rizika. Tímto prohlašujete, že rozumíte všem rizikům spojeným s nákupem, prodejem a směnou Bitcoinu, včetně skutečnosti, že transakce s Bitcoinem jsou nevratné. Prohlašujete, že chápete, že hodnota Bitcoinu může být extrémně volatilní a že jeho směnný kurz vůči jiným kryptoměnám nebo fiat měnám může výrazně kolísat, což může vést k výraznému a náhlému snížení hodnoty Vašeho majetku. Tímto berete na vědomí, že nesete výhradní odpovědnost za získání potřebných informací o daňových nebo podobných povinnostech, které vzniknou v souvislosti s jakýmikoliv uskutečněnými transakcemi, a za srážku, výběr, vykazování a odvádění správných částek daně příslušným orgánům. Berete na vědomí, že v těchto Smluvních podmínkách nejsou uvedena všechna rizika související s užíváním kryptoměn. **Důležité upozornění: Vexl pro pohodlí uživatelů zobrazuje aktuální cenu Bitcoinu. Nicméně žádná všeobecně uznávaná cena Bitcoinu neexistuje a ceny se na různých kryptoměnových burzách obvykle liší. Vexl tedy ukazuje průměrnou cenu Bitcoinu poskytovanou platformou CoinGecko ([https://coingecko.com](https://coingecko.com)).** 14. **UKONČENÍ** Vždy nás bude mrzet, že odcházíte, ale pokud se rozhodnete Vexl dále nevyužívat, budeme Vaše rozhodnutí respektovat. Váš uživatelský účet lze smazat poměrně snadno, a to klepnutím na tlačítko "odhlásit" umístěné v uživatelském rozhraní. Po odhlášení již nelze obnovit žádná data související s původním uživatelským účtem. **Důležité upozornění: Pokud se rozhodnete odhlásit, buďte opatrní, protože odhlášením dojde k faktickému vymazání Vašeho uživatelského účtu. Taková akce je nevratná, takže pokud se v budoucnu rozhodnete Vexl znovu používat, nebudete moci obnovit žádná data spojená s Vaším původním uživatelským účtem a budete muset projít stejným procesem registrace jako jakýkoliv nový uživatel.** Vyhrazujeme si také výslovně právo pozastavit nebo trvale odepřít přístup k Vexlu uživatelům nacházejícím se v určitých zemích nebo státním příslušníkům určitých zemí, a to především z regulatorních důvodů (Vaši polohu nebo státní příslušnost můžeme identifikovat také nepřímo, například podle kódu země, appstoru nebo Vašeho telefonního čísla). A konečně, vyhrazujeme si také právo zcela ukončit činnost Vexlu. V takovém případě Vás upozorníme alespoň třicet (30) dní předem. Po uplynutí této lhůty budeme mít možnost ukončit provoz Vexlu a vy tak již nebudete mít možnost přístupu ke svému uživatelskému účtu. 15. **OZNÁMENÍ** **Vaše zprávy nám:** Můžete nás kontaktovat elektronicky prostřednictvím nástrojů dostupných na našich webových stránkách nebo prostřednictvím e-mailové adresy [support@vexl.it](mailto:support@vexl.it). Vaše zpráva je považována za doručenou, okamžikem, kdy Vám potvrdíme její doručení, což se vždy snažíme udělat okamžitě. **Naše zprávy Vám:** Nechceme Vás příliš obtěžovat, ale občas Vás možná i tak budeme muset kontaktovat. V takovém případě použijeme push notifikaci, která se Vám zobrazí po přihlášení k Vašemu uživatelskému účtu. 16. **ROZHODNÉ PRÁVO** Vaše užívání Vexlu, jakož i tyto Smluvní podmínky a veškeré související záležitosti, včetně sporů mezi Vámi a námi, se řídí právním řádem České republiky, a to bez ohledu na kolizní pravidla. **Pouze pro spotřebitele:** Jsme povinni Vás informovat, že tato doložka o volbě práva Vás nezbavuje, pokud jste spotřebitel, práv vyplývajících z kogentních ustanovení práva země Vašeho obvyklého bydliště v případě, že by se toto právo jinak použilo podle čl. 6 odst. 1 nařízení Evropského parlamentu a Rady (ES) č. 593/2008 ze dne 17. června 2008 o právu rozhodném pro smluvní závazkové vztahy (Řím I). 17. **ŘEŠENÍ SPORŮ** Vždy se snažíme vyřešit jakýkoliv problém smírně a žádáme Vás o totéž. Proto souhlasíte s tím, že nás budete informovat o všech sporech, které vzniknou na základě těchto Smluvních podmínek, nebo v souvislosti s nimi, a souhlasíte s tím, že než se obrátíte na soud, pokusíte se vždy o mimosoudní řešení sporu. Někdy však mimosoudní řešení sporu není prostě možné. V takovém případě budou veškeré spory, které se jakýmkoliv způsobem týkají těchto Smluvních podmínek, s konečnou platností řešeny před soudem České republiky příslušným podle místa sídla naší společnosti. **Pouze pro spotřebitele:** Jsme povinni Vás informovat, že v případě jakéhokoliv sporu máte právo se obrátit ohledně možnosti mimosoudního řešení sporu na Český telekomunikační úřad, se sídlem Sokolovská 58/219, Praha 9, IČO: 701 06 975, prostřednictvím webové stránky [https://www.ctu.eu/out-court-dispute-resolution](https://www.ctu.eu/out-court-dispute-resolution), pro spory týkající se elektronických komunikací, a dále na Českou obchodní inspekci, se sídlem Štěpánská 567/15, 120 00 Praha 2, IČO: 000 20 869, prostřednictvím webové stránky [https://adr.coi.cz/cs](https://adr.coi.cz/cs), v případě jakýchkoliv jiných sporů. Můžete také využít platformu pro mimosoudní řešení sporů, umístěnou na webových stránkách [http://ec.europa.eu/consumer/odr](http://ec.europa.eu/consumer/odr). 18. **ZMĚNY** **Provozovatel:** Souhlasíte s jakoukoliv případnou budoucí změnou provozovatele Vexl podle těchto Smluvních podmínek (postoupení smlouvy založené těmito Smluvními podmínkami). V případě takové změny Vás budeme vždy informovat. **Smluvní podmínky:** Tyto Smluvní podmínky nebo další podmínky, které se vztahují na Vexl (například Zásady ochrany osobních údajů), můžeme čas od času změnit nebo doplnit a pokud tak učiníme, budeme Vás muset požádat, abyste si je znovu přečetli a souhlasili s nimi. Uvědomujeme si, že je to pro Vás nepohodlné, a proto slibujeme, že to nebudeme dělat příliš často. Vaše další užívání Vexlu potvrzuje Váš souhlas s aktualizovanými Smluvními podmínkami.
