Repository: vexl-it/vexl-ios
Catalog: vexl/Resources/*.lproj/Localizable.strings
Languages: cs, sk

# register.phone.code.input.retry
source: Didn’t receive a code? Resend in %@ s
cs: Neobdržel jsi kód? Zkus poslat znova za %@ s
sk: Nedostal si kód? Skús ho poslať znovu za %@ s

# register.phone.code.input.send.code
source: Didn’t receive a code? Click here to try again.
cs: Neobdržel jsi kód? Zkus poslat znova
sk: Nedostal si kód? Skús ho poslať znovu

# register.phone.code.input.verifying
source: Verifying...
cs: Ověřuji...
sk: Overujem...

# register.phone.code.input.success
source: Success!
cs: Povedlo se!
sk: Podarilo sa!

# register.phone.number.error
source: Please enter your phone number in the correct format including country code.
cs: Zadej své číslo ve správném formátu včetně předvolby
sk: Zadaj svoje číslo v správnom formáte vrátane predvoľby

# register.phone.number.code.sent
source: Code was sent!
sk: Kód bol zaslaný!

# register.phone.number.expired
source: Verification expired. Start your registration again, please
sk: Verifikácia expirovala. Prosím zaregistruj sa znovu

# register.name.avatar.input.title
source: What do your friends call you?
cs: Jak ti kamarádi říkají?
sk: Ako ti vravia kamaráti?

# register.name.avatar.input.subtitle
source: Nobody will see it until you allow it.
cs: Bez tvého svolení tvé jméno nikdo neuvidí.
sk: Bez tvojho dovolenia ho nikto neuvidí.

# register.name.avatar.input.placeholder
source: Name or nickname
cs: Tvoje jméno nebo přezdívka
sk: Tvoje meno alebo prezývka

# register.name.avatar.image.title
source: Choose a profile picture.
cs: Jak vypadáš?
sk: Vyber si svoju profilovú fotku.

# register.name.avatar.image.subtitle
source: Nobody will see it until you allow it.
cs: Bez tvého svolení nikdo tvou fotku neuvidí.
sk: Bez tvojho dovolenia nikto tvoju fotku neuvidí (ani my).

# register.name.avatar.image.header
source: Hey %@!
cs: Nazdar, %@!
sk: Ahoj %@!

# register.name.avatar.continue
source: Continue
sk: Pokračovať

# register.name.avatar.phone.validated
source: Phone number verified. Let’s setup your profile.
cs: Telefon ověřen. Čas nastavit tvůj profil.
sk: Tvoje číslo bolo overené. Čas nastaviť tvoj profil.

# register.name.avatar.camera
source: Camera
cs: Foťák
sk: Foťák

# register.name.avatar.photo.album
source: Photo Album
cs: Knihovna
sk: Fotoalbum

# register.name.avatar.image.picker
source: Select the source of your avatar.
cs: Vyber si, odkud chceš obrázek nahrát
sk: Vyber si, odkiaľ chceš obrázok nahrať

# anonymize.user.title
source: This is your private profile.
cs: Toto je tvá identita
sk: Toto je tvoj súkromný profil.

# anonymize.user.title2
source: This is your new Vexl identity!
cs: Identity anonymized!
sk: Toto je tvoja Vexl identita!

# anonymize.user.note
source: Nobody will see it until you allow it.
cs: Bez tvého svolení nikdo tvoji identitu neuvidí.
sk: Bez tvojho dovolenia ho nikto neuvidí.

# anonymize.user.note2
source: This is how others see you until you choose to reveal your private profile.
cs: This is how other users will see you until you reveal your real identity.
sk: Takto ťa uvidia ostatní užívatelia, než im odhalíš svoj súkromný profil.

# anonymize.user.btn
source: Anonymize
cs: Anonymizovat
sk: Anonymizovať

# register.contacts.import.button
source: Import contacts
cs: Import kontaktů
sk: Import kontaktov

# register.contacts.import.deselect
source: Deselect All
cs: Zrušit výběr
sk: Zrušiť výber

# register.contacts.import.select
source: Select All
cs: Vybrat vše
sk: Vybrať všetko

# register.contacts.import.empty
source: There are no contacts to import
cs: Nemáš žádné kontakty
sk: Nemáš žiadne kontakty

# register.contacts.skip
source: Skip for now
cs: Zatím přeskočit
sk: Zatiaľ preskočiť

# register.contacts.import.alert.allow
source: Allow
cs: Povolit
sk: Povoliť

# register.contacts.import.alert.not.allow
source: Don’t allow
cs: Zakázat
sk: Zakázať

# register.phone.contacts.title
source: Connect with your friends!
cs: Najít kamarády
sk: Prepojiť s priateľmi

# register.phone.contacts.subtitle
source: Contacts are encrypted (even for us).
cs: Vexl nevidí tvoje kontakty
sk: Kontakty sú šifrované (aj pre nás).

# register.phone.alert.request.title
source: Allow contacts
cs: Povolit kontakty
sk: Povoliť import kontaktov

# register.phone.alert.request.description
source: Vexl needs access to your contacts in order to work. Don't worry we won’t ever see them
cs: Vexl potřebuje přístup k tvým kontaktům. Nemusíš ale mít obavy, nikdo je neuvidí.
sk: Vexl potrebuje prístup k tvojim kontaktom. Nemusíš mať obavy, nikto ich neuvidí.

# register.phone.alert.reject.title
source: Really?
cs: Opravdu?
sk: Naozaj?

# register.phone.alert.reject.description
source: Vexl only works by anonymously using your contacts to connect you with other users.
cs: Vexl potřebuje tvoje kontakty k tomu, aby tě anonymně spojil s ostatními vexláky.
sk: Vexl potrebuje tvoje kontakty na to, aby ťa anonymne spojil s ostatnými vexlákmi.

# register.facebook.contacts.title
source: Expand your network with Facebook
cs: Propoj s Facebookem a rozšiř svůj dosah
sk: Prepoj s Facebookom a rozšír svoj dosah!

# register.facebook.import.button
source: Import Facebook contacts
cs: Import přátel z Facebooku
sk: Import priateľov z Facebooku

# register.contacts.update.button
source: Update
cs: Aktualizovat
sk: Aktualizovať

# register.contacts.back.button
source: Back
cs: Zpět
sk: Späť

# notifications.permission.title
source: Allow notifications
sk: Povoliť notifikácie

# notifications.permission.subttile
source: Enabling notifications is crucial for Vexl to function correctly.
sk: Zapnuté notifikácie sú kľúčové pre správne fungovanie Vexlu.

# notifications.permission.enable
source: Enable
sk: Povoliť

# notifications.permission.reject.title
source: Really?
sk: Naozaj?

# notifications.permission.dialog.title
source: Please enable notifications, Vexl will not work without them. Don't worry, we won't spam you.
sk: Povoľ notifikácie, prosím. Vexl bez nich nebude fungovať tak, ako má. Nemusíš mať obavy, nebudeme ťa spamovať.

# notifications.permission.dialog.allow
source: Allow
sk: Povoliť

# notifications.permission.dialog.dont.allow
source: Don't allow
sk: Zakázať

# notifications.permission.disabled.title
source: Notifications disabled
sk: Vypnuté notifikace

# notifications.permission.disabled.subtitle
source: You have disabled notifications. Please enable them in Settings as Vexl will not work without them. Don't worry, we won't spam you.
sk: Máš vypnuté notifikácie. Povoľ ich v nastaveniach, Vexl bez nich nebude fungovať tak, ako má. Nemusíš mať obavy, nebudeme ťa spamovať.

# notifications.permission.disabled.button
source: Go to Settings
sk: Isť do Nastavení

# error.register.invalid.validation.code
source: The validation code is invalid
cs: Ověřovací kód je neplatný
sk: Overovací kód je neplatný

# error.register.invalid.challenge
source: There was an error validating the user
cs: Při ověření uživatele došlo k chybě
sk: Pri overení užívateľa došlo k chybe

# error.register.invalid.email
source: The email is invalid
cs: Neplatný email
sk: Neplatný email

# error.register.invalid.username
source: The username is unavailable
cs: Toto uživatelské jméno už někdo používá
sk: Toto užívatelské meno už niekto používa

# error.register.facebook.access
source: Couldn't access Facebook account
cs: Nepovedlo se spojit s FB účtem
sk: Nepodarilo sa získať prístup k tvôjmu Facebooku

# error.register.facebook.friends
source: Couldn't load Facebook friends
cs: Nepovedlo se nahrát FB přátele
sk: Nepodarilo sa nahrať Facebook priateľov

# user.profile.change.picture
source: Change profile picture
cs: Změnit profilový obrázek
sk: Zmeniť profilový obrázok

# user.profile.edit.name
source: Edit name
cs: Upravit jméno
sk: Upraviť meno

# user.profile.pin.faceId
source: Set PIN / FaceID
cs: Nastavit PIN / FaceID
sk: Nastaviť PIN / FaceID

# user.profile.allow.screenshots
source: Allow Screenshots
cs: Povolit screenshoty
sk: Povoliť screenshoty

# user.profile.allow.screenshots.description
source: Prevent screenshots
cs: Zablokovat screenshoty
sk: Zablokovať screenshoty

# user.profile.imported.contacts
source: Contacts management
cs: Nahrané kontakty
sk: Správa kontaktov

# user.profile.imported.contacts.subtitle
source: %@ friends
cs: %@ přátel
sk: %@ priateľov

# user.profile.import.facebook
source: Import Facebook contacts
cs: Facebook import
sk: Importovať kontakty z Facebooku

# user.profile.terms.and.privacy
source: Terms of Use and Privacy Policy
cs: Podmínky použití a ochrana osobních údajů
sk: Podmienky použitia a Ochrana súkromia

# user.profile.faq
source: FAQs
cs: Často kladené otázky
sk: Často kladené otázky

# user.profile.report.issue
source: Report issue
cs: Nahlásit problém
sk: Nahlásiť problém

# user.profile.request.data
source: Request known data
cs: Vyžádat uložená data
sk: Vyžiadať uložené dáta

# user.profile.logout
source: Delete account
cs: Smazat účet
sk: Vymazať účet

# user.profile.currency
source: Currency
cs: Měna
sk: Mena

# user.profile.logout.info
source: Trying to logout? There is no such option, but you can delete your account.
cs: Can’t find logout? There’s no such a thing. But you can delete account.
sk: Chceš sa odhlásiť? Taká možnosť vo Vexli nie je - môžeš ale vymazať účet.

# user.profile.vexl.support
source: If you like Vexl, support it’s improvement by sending some Bitcoin as donation!
sk: Ak se ti Vexl páči, budeme radi za tvoj príspevok v tvrdej mene.

# user.profile.refuse.snap.chat
source: Allow in-app screenshots
cs: Refuse users to snap the chat
sk: Povoliť screenshoty v aplikácií

# user.profile.private.settings.title
source: Private settings
sk: Súkromný profil

# user.profile.private.settings.subtitle
source: Unlock to access your private profile.
cs: Unlock to access your identity and contacts
sk: Odomkni pre prístup do súkromného profilu.

# user.profile.edit.name.title
source: Edit name
sk: Upraviť meno

# user.profile.edit.name.subtitle
source: Remember your name won't be revealed without your permission.
cs: Space for additional copy. You can lorem ipsum dolor sit ametum roma von carpa di.
sk: Nezabudni, že tvoje meno bez tvojho dovolenia nikto neuvidí.

# user.profile.edit.name.action
source: Save
sk: Uložiť

# user.profile.edit.avatar.title
source: Change profile picture
sk: Zmeniť profilovú fotku

# user.profile.edit.avatar.subtitle
source: Remember your profile photo won't be revealed without your permission.
cs: Space for additional copy. You can lorem ipsum dolor sit ametum roma von.
sk: Nezabudni, že tvoju fotku bez tvojeho povolenia nikto neuvidí.

# user.profile.edit.avatar.action
source: Upload new photo
sk: Nahrať novú fotku

# user.profile.edit.avatar.delete
source: Delete photo?
sk: Vymazať fotku?

# user.profile.edit.avatar.empty.image.error
source: No image chosen
sk: Nevybral si žiadnu fotku

# user.profile.delete.account.title
source: Delete account?
sk: Vymazať účet?

# user.profile.delete.account.subtitle
source: Are you sure? This action is irreversible!
cs: Do you really want to delete your account? You will never be able to undo this action.
sk: Naozaj chceš vymazať svoj účet? Táto akcia je nevratná.

# user.profile.delete.account.no
source: Nope
sk: Nie

# user.profile.delete.account.yes.delete
source: Yes, delete
sk: Áno, vymazať

# user.profile.delete.account.yes
source: Yes
sk: Áno

# user.profile.delete.account.title.sure
source: Are you sure?
cs: You sure?
sk: Naozaj?

# user.profile.join.vexl.title
source: Share Vexl!
cs: Připoj se k Vexlu
sk: Zdieľaj Vexl!

# user.profile.join.vexl.button.title
source: Got it
cs: Rozumím
sk: Rozumiem

# user.profile.donate.title
source: Give love
cs: Daruj love
sk: Podpor nás

# user.profile.donate.description
source: If you like Vexl, support its development by sending us some sound money as a donation.
cs: Pokud se ti Vexl líbí, budeme rádi za trochu Bitcoinu na jeho další vylepšování.
sk: Ak sa ti Vexl páči, budeme radi za tvoj príspevok v tvrdej mene.

# user.profile.donate.button.donate
source: Donate
cs: Darovat
sk: Prispieť

# user.profile.donate.button.dismiss
source: Back
cs: Zpět
sk: Späť

# user.profile.delete.photo.title
source: Delete photo
sk: Vymazať fotku

# user.profile.delete.photo.subtitle
source: Do you really want to delete your photo? You can always upload a new image if you want.
sk: Naozaj chceš vymazať fotku? Vždy môžeš nahrať novú, ak budeš chcieť.

# user.profile.delete.photo.no
source: Nope
sk: Nie

# user.profile.delete.photo.yes
source: Yes
sk: Áno

# user.profile.currency.title
source: Currency
cs: Měna
sk: Mena

# user.profile.currency.czk
source: Czech crown
cs: Česká koruna
sk: Česká koruna

# user.profile.currency.usd
source: United States dollar
cs: Americký dolar
sk: Americký dolár

# user.profile.currency.dismissButton
source: Done
cs: Hotovo
sk: Hotovo

# user.profile.report.issue.subject
source: Vexl: Submit report
cs: Vexl: Issue report
sk: Vexl: Nahlásiť problém

# user.profile.report.issue.text
source: Hi! I'm contacting you due to ...
cs: I'm contacting you due to ...
sk: Ahoj, píšem ohľadom...

# user.profile.report.issue.error.no.app.found
source: No email application found
sk: Emailový klient nenájdený

# user.profile.report.issue.title
source: Something went wrong?
cs: Něco se pokazilo?
sk: Niečo sa pokazilo?

# user.profile.report.issue.subtitle
source: Contact support.
cs: Kontaktujte náš support.
sk: Kontaktuj náš support.

# user.profile.report.issue.confirm
source: Got it
cs: Chápu
sk: Rozumiem

# user.profile.request.data.title
source: Request your data
cs: Vyžádat uživatelská data
sk: Vyžiadať moje dáta

# user.profile.request.data.subtitle
source: Find out what we know about you.
cs: Download package with everything we know about you.
sk: Zisti, čo všetko o tebe vieme.

# user.profile.request.confirm.button
source: Download
cs: Stáhnout
sk: Stiahnuť

# user.profile.request.dismiss.button
source: Back
cs: Zpět
sk: Späť

# marketplace.currency.variation.1day
source: %1$@ %% today
cs: %1$@ %% dnes
sk: %1$@ %% dnes

# marketplace.currency.variation.1week
source: %1$@ %% since last week
cs: %1$@ %% před týdnem
sk: %1$@ %% za týždeň

# marketplace.currency.variation.1month
source: %1$@ %% since last month
cs: %1$@ %% před měsícem
sk: %1$@ %% za mesiac

# marketplace.currency.variation.3month
source: %1$@ %% since 3 months ago
cs: %1$@ %% před 3 měsíci
sk: %1$@ %% za 3 mesiace

# marketplace.currency.variation.6month
source: %1$@ %% since 6 months ago
cs: %1$@ %% před 6 měsíci
sk: %1$@ %% za 6 mesiacov

# marketplace.currency.variation1year
source: %1$@ %% since last year
cs: %1$@ %% před rokem
sk: %1$@ %% za rok

# marketplace.currency.1day
source: 1 day
cs: 1 den
sk: 1 deň

# marketplace.currency.1week
source: 1 week
cs: 1 týd
sk: 1 týž

# marketplace.currency.1month
source: 1 mth
cs: 1 měs
sk: 1 mes

# marketplace.currency.3month
source: 3 mth
cs: 3 měs
sk: 3 mes

# marketplace.currency.6month
source: 6 mth
cs: 6 měs
sk: 6 mes

# marketplace.currency.1year
source: 1 year
cs: 1 rok
sk: 1 rok

# marketplace.buy
source: Buying
cs: Koupit
sk: Nákup

# marketplace.sell
source: Selling
cs: Prodat
sk: Predaj

# marketplace.facebook.friend
source: Facebook friend
cs: Přítel z Facebooku
sk: Priateľ z Facebooku

# marketplace.phone.contact
source: Phone contact
cs: Kontakt z telefonu
sk: Kontakt z telefónu

# marketplace.sell.offer
source: My offers
cs: Moje nabídky
sk: Moje ponuky

# marketplace.detail.friend.first
source: Friend
cs: Přítel
sk: Priateľ

# marketplace.detail.friend.second
source: Friend of a Friend
cs: Přítel přítele
sk: Priateľ priateľa

# marketplace.detail.sell
source: Selling
cs: K prodeji
sk: K predaju

# marketplace.detail.buy
source: Buying
cs: K nákupu
sk: K nákupu

# marketplace.detail.user.sell
source: %@ is selling
cs: %@ prodává
sk: %@ predáva

# marketplace.detail.user.buy
source: %@ is buying
cs: %@ nakupuje
sk: %@ nakupuje

# marketplace.detail.up.to
source: Up to
sk: do

# marketplace.detail.fee
source: Includes %1$@ %% transaction fee
sk: Zahrňuje %1$@ %% transakčný poplatok

# offer.request
source: Request
cs: Žádost
sk: Žiadosť

# offer.requested
source: Requested
cs: Žádost poslána
sk: Žiadosť zaslána

# offer.your.offer
source: Your offer
sk: Tvoja ponuka

# offer.sell.title
source: Create new offer
cs: Moje nabídky prodeje
sk: Nová ponuka

# offer.buy.title
source: Create new offer
cs: Moje poptávky nákupu
sk: Nová ponuka

# offer.buy.create.title
source: Create new offer
cs: Moje poptávka nákupu
sk: Nová ponuka

# offer.sell.create.title
source: Create new offer
cs: Moje nabídka prodeje
sk: Nová ponuka

# offer.sell.new.offer
source: Create new offer
cs: Nová nabídka prodeje
sk: Nová ponuka

# offer.buy.new.offer
source: Create new offer
cs: Nová poptávka nákupu
sk: Nová ponuka

# offer.sell.amount.toSell
source: Selling
cs: K prodeji
sk: K predaju

# offer.buy.amount.toBuy
source: Buying
cs: K nákupu
sk: K nákupu

# offer.sell.noLocation
source: No Location
cs: Bez lokality
sk: Bez lokality

# offer.sort.active
source: %@ active offers
cs: %@ aktivních nabídek
sk: %@ aktívnych ponúk

# offer.sort.newest
source: Sorted by newest
cs: Seřazeno od nejnovějších
sk: Zoradené od najnovších

# offer.sort.oldest
source: Sorted by oldest
cs: Seřazeno od nejstarších
sk: Zoradené od najstarších

# offer.mine
source: My offer
cs: Moje nabídka
sk: Moja ponuka

# offer.edit
source: Edit offer
cs: Upravit nabídku
sk: Upraviť ponuku

# offer.added
source: Added %@
cs: Přidáno %@
sk: Pridané %@

# error.missing.offer.location
source: Missing location
sk: Chýba lokácia

# filter.apply
source: Apply filter
cs: Použít filtr
sk: Použíť filter

source: Filter offers
cs: Filtrovat nabídky
sk: Filtrovať ponuky

# offer.create.fee.none
source: Without fee
cs: Bez poplatku
sk: Bez poplatku

# offer.create.fee.ok
source: With fee
cs: S poplatkem
sk: S poplatkom

# offer.create.trade.style.personal
source: Only in person
cs: Pouze osobně
sk: Iba osobne

# offer.create.trigger.active
source: Offer is active when price is
cs: Aktivní při ceně
sk: Ponuka je aktívna pri cene

# offer.create.trigger.title
source: Price triggers
cs: Spouštěče
sk: Cenové spúšťače

# offer.create.trigger.below
source: Below
cs: Pod
sk: Pod

# offer.create.trigger.above
source: Above
cs: Nad
sk: Nad

# offer.createtrigger.btc.current
source: currently 1 BTC = $%f
cs: právě teď 1 BTC = $%f
sk: práve teraz 1 BTC = $%f

# offer.create.trigger.delete
source: Delete offer after
cs: Smazat nabídku za
sk: Zmazať ponuku za

# offer.create.trigger.delete.timeframe
source: Timeframe
cs: Časové rozmezí
sk: Časové rozmedzie

# offer.create.trigger.delete.days
source: Days
cs: Dnů
sk: Dní

# offer.create.trigger.delete.weeks
source: Weeks
cs: Týdnů
sk: Týždňov

# offer.create.trigger.delete.months
source: Months
cs: Měsíců
sk: Mesiacov

# offer.create.status.pause
source: Pause
cs: Pauza
sk: Pauza

# offer.create.status.activate
source: Activate
cs: Aktivovat
sk: Aktivovať

# offer.create.status.delete
source: Delete
cs: Smazat
sk: Vymazať

# offer.create.status.active
source: Active
cs: Aktivní
sk: Aktívna

# offer.create.status.inactive
source: Inactive
cs: Neaktivní
sk: Neaktívna

# offer.create.status.amount.title
source: Amount
cs: Množství
sk: Množstvo

# offer.create.amount.min.title
source: Min. price
sk: Min. cena

# offer.create.amount.max.title
source: Max. price
sk: Max. cena

# offer.create.location.title
source: Location
cs: Lokalita
sk: Lokalita

# offer.create.location.add
source: Another Location
cs: Jiná lokalita
sk: Iná lokalita

# offer.create.payment.method.cash
source: Cash
cs: Hotovost
sk: Hotovosť

# offer.create.payment.method.bank
source: Bank
cs: Převod
sk: Prevod

# offer.create.payment.method.title
source: Payment method
cs: Platební metoda
sk: Platobná metoda

# offer.create.advanced.friend.source
source: Friend source
cs: Zdroj kontaktu
sk: Zdroj kontaktu

# offer.create.advanced.friend.source.contact
source: Contact list
cs: Telefonní seznam
sk: Telefónny zoznam

# offer.create.advanced.friend.level.first
source: 1st degree
cs: 1. úroveň
sk: 1. úroveň

# offer.create.advanced.friend.level.second
source: 2nd degree
cs: 2. úroveň
sk: 2. úroveň

# offer.create.advanced.friend.description
source: Trade with your friends only. Trade with friends of your friends.
cs: Vexluj jenom s přáteli. Nebo i s přáteli přátel.
sk: Vexluj iba s priateľmi. Alebo aj s priateľmi priateľov.

# offer.create.advanced.group.title
source: Group
sk: Skupina

# offer.create.advanced.group.description
source: Share offer in group
sk: Zdieľaj ponuku v skupine

# offer.create.description
source: Description
cs: Popis
sk: Popis

# offer.create.description.placeholder
source: Enter offer description
cs: Popiš svou nabídku
sk: Popíš svoju ponuku

# offer.create.currency
source: Currency
cs: Měna
sk: Mena

# offer.create.advanced.title
source: Advanced
cs: Pokročilé
sk: Pokročilé

# offer.create.advanced.type
source: Type
cs: Typ
sk: Typ

# offer.create.advanced.friend.level.title
source: Friend level
cs: Úroveň přítele
sk: Úroveň priateľa

# offer.create.action.title
source: Create sell offer
cs: Vytvořit nabídku prodeje
sk: Vytvoriť ponuku predaja

# offer.update.action.title
source: Update sell offer
cs: Aktualizovat nabídku prodeje
sk: Aktualizovať ponuku predaja

# offer.create.buy.action.title
source: Create buy offer
cs: Vytvořit poptávku nákupu
sk: Vytvoriť ponuku nákupu

# offer.update.buy.action.title
source: Update buy offer
cs: Aktualizovat poptávku nákupu
sk: Aktualizovať ponuku nákupu

# offer.location.placeholder
source: City
sk: Mesto

# offer.location.suggestions.empty
source: No suggestions
sk: Žiadne návrhy

# offer.progress.title.loading
source: Encrypting your offer ...
sk: Tvoja ponuka sa šifruje ...

# offer.progress.title.complete
source: Done! Offer posted.
sk: Hotovo! Ponuka odoslaná.

# offer.progress.bar.title
source: for %@ vexlers
sk: pre %@ vexlákov

# offer.progress.bar.subtitle
source: %@ done
sk: %@ hotovo

# offer.progress.bar.title.complete
source: Anonymously delivered to %@ vexlers
sk: Anonymne doručené pre %@ vexlákov

# offer.progress.subtitle
source: Don’t shut down the app while encrypting. It can take several minutes.
sk: Nevypínaj aplikáciu počas šifrovania. Môže to trvať niekoľko minút.

# offer.progress.subtitle.complete
source: Your friends and friends of their friends can now see your offer.
sk: Priatelia a priatelia ich priateľov môžu odteraz vidieť tvoju ponuku.

# request.title.normal
source: Offer
cs: Nabídka
sk: Ponuka

# request.title.requesting
source: Sending
cs: Odesílám
sk: Odosielam

# request.placeholder
source: e.g. Let's vexl my friend...
cs: např. pojď zavexlit, kámo!
sk: napr. Poď zavexlovať, kamoško!

# request.button
source: Send request
cs: Odeslat žádost
sk: Odoslať žiadosť

# request.common.friends
source: %d common friends
cs: %d společných přátel
sk: %d spoločných priateľov

# request.common.friends.empty.state
source: You don't have common friends
sk: Nemáte spoločných priateľov

# chat.filter.all
source: All
cs: Vše
sk: Všetky

# chat.filter.buy
source: Buyers
cs: Kupující
sk: Kupujúci

# chat.filter.sell
source: Sellers
cs: Prodávající
sk: Predávajúci

# chat.messageMe
source: me:
cs: já:
sk: ja:

# chat.request.identity.sent
source: Identity reveal requested!
sk: Odhalenie identity vyžiadané!

# chat.request.identity.receive
source: Identity reveal request received!
sk: Nová žiadosť o odhalenie identity!

# chat.request.identity.decline
source: Declined to reveal identity
sk: Žiadosť o odhalenie identity zamietnutá

# chat.request.identity.approve
source: Identity revealed!
sk: Identita odhalená!

# chat.request.main.title
source: %@ Requests
cs: %@ Žádosti
sk: %@ Žiadostí

# chat.request.accept
source: Accept
cs: Přijmout
sk: Prijať

# chat.request.decline
source: Decline
cs: Odmítnout
sk: Odmietnuť

# chat.request.myOffer
source: My Offer
cs: Moje nabídka
sk: Moja ponuka
