Repository: vexl-it/vexl-ios
Catalog: vexl/Resources/*.lproj/Localizable.strings
Languages: cs, sk

# general.continue
source: Continue
cs: Pokračovat
sk: Pokračovať

# general.more
source: More
cs: Více
sk: Viac

# general.close
source: Close
cs: Zavřít
sk: Zavrieť

# general.play
source: Play
cs: Spustit
sk: Spustiť

# general.pause
source: Pause
cs: Pauza
sk: Pauza

# general.cancel
source: Cancel
cs: Zrušit
sk: Zrušiť

# general.back
source: Back
cs: Zpět
sk: Späť

# general.done
source: Done
cs: Hotovo
sk: Hotovo

# general.save
source: Save
sk: Uložiť

# general.internal.server.error
source: There was a server error. Please try again.
cs: Na serveru došlo k chybě. Zkus to prosím znovu.
sk: Na serveri došlo k chybe. Skús to prosím znova.

# general.timeout
source: The request timed out. Please try again.
cs: Požadavek vypršel. Zkus to prosím znovu.
sk: Požiadavok vypršal. Skús to prosím znova.

# general.search
source: Search
cs: Vyhledat
sk: Vyhľadať

# general.anonymous
source: Anonymous
cs: Anonym
sk: Anonym

source: Next
cs: Dále
sk: Ďalej

source: Skip
cs: Přeskočit
sk: Preskočiť

source: Got it
cs: Rozumím!
sk: Rozumiem

source: Continue
cs: Pokračovat
sk: Pokračovať

# button.gotIt
source: Got it
cs: Rozumím
sk: Rozumiem

# general.delete
source: Delete
sk: Vymazať

# onboarding.intro.message.friend
source: Connect anonymously with your contacts.
cs: Anonymní import přátel.
sk: Anonymne se spoj so svojimi kontaktmi.

# onboarding.intro.message.buySell
source: See buy & sell offers.
cs: Nabídky a poptávky od tvých kontaktů.
sk: Pozri sa na ich ponuky.

# onboarding.intro.message.request
source: Start chatting, reveal identities and trade.
cs: Líbí se ti něčí nabídka? Spojte se a vexlujte!
sk: Začnite chatovat, odhaľte svoje identity a obchodujte.

# welcome.title
source: Welcome! Ready to get started?
cs: Chceš začít vexlovat?
sk: Vitaj! Chceš začať vexlovať?

# welcome.terms.agreements
source: I agree to Terms of Use
cs: Souhlasím s podmínkami
sk: Súhlasím s podmienkami

# welcome.terms.agreements.one
source: I agree to
cs: Souhlasím s
sk: Súhlasím s

# welcome.terms.agreements.two
source: Terms of Use
cs: podmínkami
sk: podmienkami

# welcome.terms.agreements.link
source: Terms of Use
cs: podmínkami
sk: podmienkami

# welcome.button
source: Continue
cs: Pokračovat
sk: Pokračovať

# terms.of.use.title
source: Terms of Use
cs: Podmínky použití
sk: Podmienky použitia

# terms.of.use.faq.button
source: Don’t have time to read all of this? Take a look at some Frequently Asked Questions (FAQs).
sk: Nemáš čas na dlhé čítanie? Mrkni na výbre z najčastejších otázok.

# terms.of.use.terms.bookmark
source: Terms of Use
cs: Podmínky použití
sk: Podmienky použitia

# terms.of.use.policy.bookmark
source: Privacy Policy
cs: Ochrana soukromí
sk: Ochrana súkromia
