Repository: vexl-it/vexl-ios
Catalog: vexl/Resources/*.lproj/Localizable.strings
Languages: cs, sk

# terms.of.use.privacy
source: {{header}}1. Who collects my personal data?{{/header}} We are a commercial company called {{b}}Vexl s.r.o.{{/b}}, with its registered office at Kundratka 2359/17a, Libeň, 180 00 Prague 8, Czech Republic, Id. No. 172 70 642, and we are registered in the commercial register kept by the Commercial court in Prague under file No. 369216. We are the company responsible for operation and development of Vexl – a service (including the application) that allows users looking to buy or sell Bitcoin to connect with each other to discuss their offers and agree upon trades (“{{b}}Vexl{{/b}}”). {{header}}2. Why should I read this document?{{/header}} You may have heard about Regulation (EU) 2016/679 of the European Parliament and of the Council of 27 April 2016 (”{{b}}Regulation{{/b}}”) more commonly known as GDPR. Under the Article 13 and 14 of the Regulation, we must provide our users and other data subjects with information on the collection, handling, protection and processing of their personal data. Therefore, in this Privacy Policy you may learn more about these topics regarding the personal data that we collect when you use Vexl. {{header}}3. What personal data is processed?{{/header}} {{u}}Onboarding and using Vexl{{/u}} We may process the following categories of personal data provided during the onboarding procedure and subsequent use of Vexl: - your name (as provided by you); - your phone number (as provided by you); - your avatar (either uploaded picture or picture taken by a built-in camera of your device); - your public key linked to your user account; - contact details of your friends imported from your phone (in a form of phone number) - your contact details (provided by other users of Vexl as part of their onboarding procedure) in a form of your phone number; - graph of your 1st and 2nd degree contacts (as explained in Vexl Terms of Service); - certain information about offers to purchase or sale Bitcoin published via Vexl; - any communication with other users of Vexl. {{b}}Please note, that (except for your public key) we cannot actually access any of the above data as it is always encrypted by you using public keys of specific users of Vexl (recipients of your offers, the users you are talking to via chat function etc.). Such data may only be decrypted using associated private keys stored locally on devices of respective users.{{/b}} Also note, that some of the above data are stored locally on the devices of the respective users and are stored on our servers only for a limited period of time necessary to transmit it to other users of Vexl (etc. communication via chat function). So even if we could decrypt such data in theory, which we actually cannot, the data are still out of our reach. In any case, if any such information is actually considered personal data, we may, {{u}}as a data controller{{/u}}, from time to time process such personal data (even if in an encrypted form unreadable to us). {{u}}Support and reporting procedures{{/u}} We may provide our users support services regarding Vexl. To be able to provide you with any support services we may have to use data obtained from you during the course of support procedure (such as your contact information etc.). We allow users to report unlawful content. To be able to assess any reports we may have to use any data obtained from you during the course of the reporting procedure (such as your contact information etc.). If any of such information is considered as personal data, we will, {{u}}as a data controller{{/u}}, collect, store and/or process such personal data. {{header}}4. Why is my personal data processed?{{/header}} We process your personal data only so we can provide you Vexl services including any support services and reporting procedures regarding Vexl. We will also process your personal data to perform any of our obligations under the Vexl Terms of Service and any applicable law and to protect our own rights thereunder. It is also in our legitimate interest to process such personal data to establish, exercise or defend any related legal claims, since otherwise we could not exercise our legal rights and such use of personal data is foreseeable by data subjects and represents little to no restriction of data subject interests, rights and freedoms. To comply with legal requirements, we must mention that we process such personal data mainly pursuant to the Article 6 (1) (b) and (f) of the Regulation. {{header}}5. For how long is my personal data processed?{{/header}} We process your personal data only for the time necessary to meet the purposes of its processing specified above, or for the time consented by you, or for the time that is either necessary to comply with our obligations under the applicable law or set forth by the applicable law or in accordance therewith. We comply with the mandatory rules for data archiving. To be specific: We process your {{u}}name, your avatar, your phone number, your public key and a graph of your 1st and 2nd degree contacts{{/u}} for as long as your user account exists. Please note, that except for your public key, we cannot actually access any of the above data as it is always encrypted with public keys of the specific users of Vexl. {{u}}Information about your offers{{/u}} is stored and processed only for the duration of the offer (set by you when placing the offer). Please note, that this information is also encrypted with specific public keys of the users that are allowed to see the offer and cannot be decrypted by us, even if transmitted via our servers. {{u}}Information provided when chatting with other users via chat function{{/u}} are processed only for the duration of the chat. Please note, that this information is also encrypted with specific public keys of the other party to the chat and cannot be decrypted by us, even if transmitted via our servers. {{u}}The data obtained during the support and reporting procedures{{/u}} will be processed until the procedure is completed and for a period of time when you are allowed under the statute of limitations to initiate any court proceedings in relation to the above procedures. {{header}}6. Who will have access to my personal data?{{/header}} We take care of your personal data security and so we choose the partners to whom we entrust your personal data very carefully. All our partners must be able to provide sufficient security of your personal data to prevent unauthorized or accidental access thereto or other abuse thereof and all our partners must undertake a confidentiality obligation and must not use your personal data for any purpose other than the purpose for which the data were made available to them. The recipients that may have access to your personal data are: - technological services providers including providers of data storage solutions; - persons who provide our services with security and integrity and who regularly test such security and integrity; - providers of accounting, legal and administrative services; - our staff. Our aim is and always will be to ensure your personal data is as anonymous as possible and unavailable to all third parties. However, under certain specifically defined conditions we will be under some circumstances required, in accordance with the applicable law, to transfer certain personal data to public authorities. {{header}}7. Do you transfer the personal data outside the EU/EEA?{{/header}} When collecting, storing and processing personal data we sometimes may use personal data processors such as Twilio, which under some circumstances transmit your personal data to third countries. In such an event we always make sure such transmission is compliant with the Regulation. In particular, we specify that the personal data may be transmitted to the United States of America and in such event the transmission is compliant with the Standard Contractual Clauses (SCCs) mechanism. For an in-depth overview, you can find Twilio's guidelines here. {{header}}8. How is my personal data protected?{{/header}} All your personal data is secured by standard procedures and technologies. We provide data protection against unauthorized or accidental access, alteration, destruction, loss, unauthorized transmission or any other unauthorized processing, as well as against any other abuse of records containing the personal data. The standard procedures and technologies may include, but are not limited to, the following: - education and training of relevant staff to ensure they are aware of our privacy obligations when handling personal data; - administrative and technical rules to restrict access to personal data on a ‘need to know’ basis; - technological security measures, including firewalls, encryption and anti-virus software; - physical security measures, such as staff security passes to access our premises. We are not able to guarantee the security of your personal data without your help and responsible behavior. Therefore, we ask you to help us ensure the security of your data by keeping your PIN private (if set up), and your device secure by following common security standards. {{header}}9. What are my rights in relation to personal data protection?{{/header}} In relation to the personal data you shall have in particular the following rights: - a right to withdraw your consent at any time; - a right to correct or make additions to the personal data; - a right to request restrictions to processing of your personal data ; - a right to object or complain against processing of your personal data under certain circumstances; - a right to request transfer of your personal data ; - a right to access your personal data; - a right to be informed of the personal data security breach under certain circumstances; a right to request deletion of your personal data (a right to be „forgotten“) under certain circumstances; and - other rights set forth in Act of the Czech republic No. 110/2019 Coll., on personal data processing (Personal Data Protection Act) and the Regulation. You have a right to object, on grounds relating to your particular situation, at any time to processing your personal data which is based on Article 6(1)(f) of Regulation (it means that we have legitimate interest to process such personal data). You have also a right to object to processing your personal data for direct marketing purposes. Additionally, you have a right to contact the Office for Personal Data Protection with a request for remedial measures in case of any violation of the obligations set forth in the Regulation at the following address: Office for Personal Data Protection, Pplk. Sochorova 27, 170 00 Prague 7, Czech Republic, phone number +420 234 665 111 (central telephone exchange). {{header}}10. How can I contact you?{{/header}} If you have any questions regarding this Privacy Policy, please do not hesitate to contact us using the contact details below: Address: Vexl s.r.o, Kundratka 2359/17a, Prague, Czech republic Email address: support@vexl.it {{header}}11. When is this Privacy Policy effective?{{/header}} This Privacy Policy comes into effect on 11. 7. 2022. We reserve the right to amend and update this Privacy Policy at any time. In the event of any changes or amendments, we will ask you to agree with this Privacy Policy again before further use of Vexl.
sk: {{header}}1. Kdo shromažďuje mé osobní údaje?{{/header}} Jsme obchodní společnost s názvem {{b}}Vexl s.r.o.{{/b}}, se sídlem Kundratka 2359/17a, Libeň, 180 00 Praha 8, IČO: 172 70 642, zapsaná v obchodním rejstříku vedeném Městským soudem v Praze, oddíl C, vložka 369216. Naše společnost je odpovědná za provoz a vývoj Vexlu – služby (včetně aplikace), která umožňuje uživatelům, kteří chtějí koupit nebo prodat Bitcoin, aby se navzájem spojili, prodiskutovali své nabídky a dohodli se na obchodu („{{b}}Vexl{{/b}}“). {{header}}2. Proč bych si měl/a přečíst tento dokument?{{/header}} Možná jste již slyšeli o nařízení Evropského parlamentu a Rady (EU) 2016/679 ze dne 27. dubna 2016 (dále jen „{{b}}Nařízení{{/b}}“), známé spíše jako GDPR. Podle čl. 13 a 14 Nařízení musíme našim uživatelům a dalším dotčeným subjektům poskytovat informace o shromažďování, nakládání, ochraně a zpracování jejich osobních údajů. Proto si v těchto Zásadách ochrany osobních údajů můžete přečíst více informací týkajících se osobních údajů, které shromažďujeme při používání služby Vexl. {{header}}3. Jaké osobní údaje jsou zpracovávány?{{/header}} {{u}}Registrace a používání služby Vexl{{/u}} Můžeme zpracovávat následující kategorie osobních údajů poskytnutých v průběhu registrace a následného používání služby Vexl: - Vaše jméno (které jste uvedli); - Vaše telefonní číslo (které jste uvedli); - Váš avatar (nahraný obrázek nebo obrázek pořízený vestavěným fotoaparátem Vašeho zařízení); - Váš veřejný klíč spojený s Vaším uživatelským účtem; - kontaktní údaje Vašich přátel importované z Vašeho telefonu (ve formě telefonního čísla); - Vaše kontaktní údaje (poskytnuté ostatními uživateli služby Vexl v rámci jejich procesu registrace) ve formě Vašeho telefonního čísla; - graf Vašich kontaktů 1. a 2. stupně (jak je vysvětleno ve Smluvních podmínkách služby Vexl); - určité informace o nabídkách nákupu nebo prodeje Bitcoinu zveřejněných prostřednictvím služby Vexl; - jakékoliv komunikace s ostatními uživateli služby Vexl. {{b}}Vezměte prosím na vědomí, že (kromě Vašeho veřejného klíče) nemáme k výše uvedeným údajům přístup, protože jsou vždy šifrovány pomocí veřejných klíčů konkrétních uživatelů (příjemců Vašich nabídek, uživatelů, se kterými komunikujete prostřednictvím chatu atd.). Tyto údaje lze dešifrovat pouze pomocí souvisejících soukromých klíčů uložených lokálně v zařízeních příslušných uživatelů.{{/b}} Vezměte také na vědomí, že některé z výše uvedených údajů jsou uloženy lokálně na zařízeních příslušných uživatelů a na našich serverech jsou uloženy pouze po omezenou dobu nezbytnou k jejich předání ostatním uživatelům služby Vexl (např. komunikace prostřednictvím funkce chatu). Takže i kdybychom teoreticky mohli taková data dešifrovat, což nemůžeme, jsou tato data stále mimo náš dosah. Pokud by přesto některé z těchto údajů byly považovány za osobní údaje, budeme, jako správce údajů, tyto osobní údaje v právním slova smyslu zpracovávat (ačkoliv budou v takovém formátu, který nám neumožní je přečíst). {{u}}Postupy podpory a ohlašování porušení{{/u}} Našim uživatelům můžeme poskytovat podporu (support) týkající se služby Vexl. Abychom vám mohli podporu poskytnout, budeme v některých případech muset použít informace získané od Vás v průběhu poskytování podpory (například Vaše kontaktní údaje apod.). Uživatelům umožňujeme ohlásit nezákonný obsah a jiná porušení Smluvních podmínek. Abychom mohli posoudit jakákoli takové ohlášení, budeme v některých případech muset použít informace získané od Vás v průběhu řešení ohlášení (jako jsou Vaše kontaktní údaje apod.). Pokud jsou některé z těchto informací považovány za osobní údaje, budeme jako {{u}}správce údajů{{/u}} tyto osobní údaje shromažďovat, uchovávat a/nebo zpracovávat. {{header}}4. Proč jsou mé osobní údaje zpracovávány?{{/header}} Vaše osobní údaje zpracováváme pouze proto, abychom Vám mohli poskytovat služby Vexl, a to včetně poskytování podpory a řešení případů ohlášení porušení týkajících se služby Vexl. Vaše osobní údaje budeme také zpracovávat za účelem splnění povinností vyplývajících ze Smluvních podmínek služby Vexl a příslušných právních předpisů a za účelem ochrany našich vlastních práv z nich vyplývajících. Je také v našem oprávněném zájmu zpracovávat tyto osobní údaje, a to za účelem uplatnění nebo případné obrany před uplatňovanými právními nároky, protože jinak bychom nemohli uplatnit svá práva. Takové použití osobních dat je pro subjekty údajů předvídatelné a nepředstavuje žádné, nebo pouze malé, omezení jejich zájmů, práv a svobod. Abychom vyhověli zákonným požadavkům musíme zmínit, že tyto osobní údaje zpracováváme zejména na základě čl. 6 odst. 1 písm. b) a f) Nařízení. {{header}}5. Jak dlouho jsou mé osobní údaje zpracovávány?{{/header}} Vaše osobní údaje zpracováváme pouze po dobu nezbytnou pro splnění výše uvedených účelů jejich zpracování, po dobu, se kterou jste souhlasili, anebo po dobu, která je buď nezbytná pro splnění našich povinností vyplývajících z příslušných právních předpisů, nebo je stanovena příslušnými právními předpisy, anebo je s nimi v souladu. Dodržujeme závazná pravidla pro archivaci údajů. Pro konkrétnost: Vaše {{u}}jméno, avatar, telefonní číslo, Váš veřejný klíč a graf Vašich kontaktů 1. a 2. stupně{{/u}} po dobu existence Vašeho uživatelského účtu. Znovu upozorňujeme, že kromě Vašeho veřejného klíče nemáme k žádnému z výše uvedených údajů faktický přístup, protože jsou vždy zašifrovány veřejnými klíči konkrétních uživatelů. {{u}}Informace o Vašich nabídkách{{/u}} se ukládají a zpracovávají pouze po dobu trvání nabídky (nastavenou Vámi při zadávání nabídky). Vezměte prosím na vědomí, že tyto informace jsou rovněž zašifrovány konkrétními veřejnými klíči uživatelů, kteří mají oprávnění nabídku vidět, a nelze je z naší strany přečíst, ani když jsou přenášeny přes naše servery. {{u}}Informace poskytnuté při chatování s jinými uživateli prostřednictvím funkce chatu{{/u}} jsou zpracovávány pouze po dobu trvání chatu. Vezměte prosím na vědomí, že tyto informace jsou rovněž šifrovány pomocí specifických veřejných klíčů druhé strany chatu a nemohou být námi dešifrovány, ani když jsou přenášeny mezi uživateli prostřednictvím našich serverů. {{u}}Údaje získané v rámci postupů podpory a hlášení porušení{{/u}} budou zpracovávány až do ukončení poskytování podpory nebo řešení konkrétního ohlášení a dále po dobu, než uplynou promlčecí lhůty k zahájení případného soudní řízení v souvislosti s výše uvedenými postupy. {{header}}6. Kdo bude mít přístup k mým osobním údajům?{{/header}} Dbáme na bezpečnost Vašich osobních údajů, a proto velmi pečlivě vybíráme partnery, kterým Vaše osobní údaje svěřujeme. Všichni naši partneři musí být schopni zajistit dostatečné zabezpečení Vašich osobních údajů tak, aby nedošlo k neoprávněnému nebo náhodnému přístupu nebo aby nedošlo k jejich jinému zneužití, a všichni naši partneři se musí zavázat k mlčenlivosti a nesmí Vaše osobní údaje použít k jinému účelu, než ke kterému jim byly poskytnuty. - Partneři, kteří mohou mít přístup k Vašim osobním údajům, jsou: - poskytovatelé technologických služeb včetně poskytovatelů úložišť dat; - osoby, které zajišťují bezpečnost a bezchybnost našich služeb a které tuto bezpečnost a bezchybnost pravidelně testují; - poskytovatelé účetních, právních a administrativních služeb; - naši zaměstnanci. Naším cílem je a vždy bude zajistit, aby Vaše osobní údaje byly co možná nejvíce anonymní a nedostupné všem třetím stranám. Upozorňujeme však, že za určitých okolností budeme povinni v souladu s příslušnými právními předpisy předat určité osobní údaje orgánům veřejné moci. {{header}}7. Předáváte osobní údaje mimo EU/EHP?{{/header}} Při zpracování osobních údajů můžeme někdy využívat zpracovatele osobních údajů, jako je například Twilio, kteří za určitých okolností předávají Vaše osobní údaje do třetích zemí. V takovém případě vždy dbáme na to, aby takové předání bylo v souladu s Nařízením. Zejména uvádíme, že osobní údaje mohou být předávány do Spojených států amerických a v takovém případě je předávání v souladu s pravidly Standardních smluvních doložek (SCC). Pro více informací o platformě Twilio, a jejich zásadách týkajících se zpracování osobních údajů prosím navštivte webové stránky Twilio zde. {{header}}8. Jak jsou mé osobní údaje chráněny?{{/header}} Všechny Vaše osobní údaje jsou zabezpečeny standardními postupy a technologiemi. Zajišťujeme ochranu údajů proti neoprávněnému nebo náhodnému přístupu, pozměnění, zničení, ztrátě, neoprávněnému přenosu nebo jinému neoprávněnému zpracování, jakož i proti jinému zneužití záznamů obsahujících osobní údaje. Standardní postupy a technologie mohou, mimo jiné, zahrnovat následující: - vzdělávání a školení příslušných zaměstnanců, aby bylo zajištěno, že znají naše povinnosti týkající se ochrany osobních údajů při nakládání s osobními údaji; - administrativní a technická pravidla pro omezení přístupu k osobním údajům pouze na need-to-know bázi; - technologická bezpečnostní opatření, včetně firewallů, šifrování a antivirového softwaru; - opatření fyzického zabezpečení, jako jsou bezpečnostní průkazy zaměstnanců pro přístup do našich prostor. Bez Vaší pomoci a zodpovědného chování nejsme schopni zaručit bezpečnost Vašich osobních údajů. Proto Vás žádáme, abyste nám pomohli zajistit bezpečnost Vašich údajů tím, že budete udržovat svůj kód PIN v tajnosti (pokud je nastaven) a své zařízení v bezpečí dodržováním běžných bezpečnostních standardů. {{header}}9. Jaká mám práva v souvislosti s ochranou osobních údajů?{{/header}} Ve vztahu k osobním údajům máte zejména následující práva: - právo kdykoli odvolat svůj souhlas se zpracováním Vašich osobních údajů; - právo na opravu nebo doplnění Vašich osobních údajů; - právo požadovat omezení zpracování Vašich osobních údajů; - právo za určitých okolností uplatnit námitku nebo podat stížnost proti zpracování Vašich osobních údajů; - právo požadovat předání Vašich osobních údajů; - právo na přístup k Vašim osobním údajům; - právo být za určitých okolností informován o narušení bezpečnosti osobních údajů; - právo požadovat za určitých okolností vymazání Vašich osobních údajů (právo být zapomenut); a - další práva stanovená zákonem č. 110/2019 Sb., o zpracování osobních údajů (zákon o ochraně osobních údajů) a Nařízením. Z důvodů týkajících se Vaší konkrétní situace máte právo kdykoli uplatnit námitku proti zpracování Vašich osobních údajů, které je založeno na čl. 6 odst. 1 písm. f) Nařízení (to znamená, že máme oprávněný zájem tyto osobní údaje zpracovávat). Také máte právo uplatnit námitku proti zpracovávání Vašich osobních údajů pro účely přímého marketingu. Dále máte právo se v případě porušení povinností stanovených Nařízením obrátit na Úřad pro ochranu osobních údajů s žádostí o přijetí opatření k nápravě, a to na adrese: Úřad pro ochranu osobních údajů, Pplk. Sochorova 27, 170 00 Prague 7, Česká republika, telefonní číslo +420 234 665 111 (ústředna). {{header}}10. Jak vás mohu kontaktovat?{{/header}} Pokud máte jakékoli dotazy týkající se těchto Zásad ochrany osobních údajů, neváhejte nás kontaktovat pomocí níže uvedených kontaktních údajů: Adresa: Vexl s.r.o, Kundratka 2359/17a, Praha Emailová adresa: support@vexl.it {{header}}11. Od kdy jsou tyto Zásady ochrany osobních údajů účinné?{{/header}} Tyto Zásady ochrany osobních údajů nabývají účinnosti dne 11. 7. 2022. Vyhrazujeme si právo tyto Zásady ochrany osobních údajů kdykoli změnit a aktualizovat. V případě jakýchkoliv změn nebo dodatků Vás před dalším používáním služby Vexl požádáme o opětovný souhlas s jejich obsahem.

# register.phone.number.input.title
source: What’s your phone number?
cs: Zadej své telefonní číslo
sk: Aké je tvoje telefónne číslo?

# register.phone.number.input.subtitle
source: It will never be shared with anyone (not even us).
cs: Tvůj telefon bude 100%% anonymní
sk: Tvoje číslo sa nikto nedozvie (ani my).

# register.phone.number.not.valid
source: Phone number is invalid
cs: Telefonní číslo není správně
sk: Telefónne číslo nie je správne

# register.phone.code.input.title
source: We've just sent you a verification code.
cs: Poslali jsme ti kód
sk: Poslali sme ti overovací kód.

# register.phone.code.input.subtitle
source: Enter it bellow to verify %@
cs: Zadej ho níže a ověř %@
sk: Zadej ho nižšie a over %@

# verify.phone.code.hint
source: Activation code
sk: Aktivačný kód
