Repository: vexl-it/vexl-ios
Catalog: vexl/Resources/*.lproj/Localizable.strings
Languages: cs, sk

# chat.message.reveal.identity
source: Reveal identity
cs: Odhalit identitu
sk: Odhaliť identitu

# chat.message.offer.my
source: My offer
sk: Moja ponuka

# chat.message.offer.theirs
source: Offer
sk: Ponuka

# chat.message.common.friend
source: Common friends
cs: Společní přátelé
sk: Spoloční priatelia

# chat.message.common.friend.empty
source: You don't share any common friends
cs: Nemáte žádné společné přátele
sk: Nemáte žiadnych spoločných priateľov

# chat.message.delete.chat
source: Delete chat
cs: Vymazat chat
sk: Vymazať chat

# chat.message.block.user
source: Block user
cs: Zablokovat uživatele
sk: Zablokovať užívateľa

# chat.message.input.placeholder
source: Type something...
cs: Napiš něco
sk: Napíš niečo...

# chat.message.started
source: • Chat has started
cs: • Chat byl zahájen
sk: • Chat bol zahájený

# chat.message.delete.title
source: Delete chat?
cs: Vymazat chat?
sk: Vymazať chat?

# chat.message.delete.description
source: Are you done vexling? Closing the chat means that you are finished with the trade. Closing the chat deletes all chat history.
cs: Dovexlováno? Chat uzavři až po dokončení transakce, uzavřením se smaže celá historie chatu.
sk: Dovexlované? Chat uzavri až po dokončení transakcie, uzavrením sa vymaže celá história chatu.

# chat.message.delete.back
source: Back
cs: Zpět
sk: Späť

# chat.message.delete.action
source: Delete chat
cs: Vymazat chat
sk: Vymazať chat

# chat.message.delete.confirm.title
source: Are you sure?
cs: Určitě?
sk: Naozaj?

# chat.message.delete.confirm.description
source: This action is permament. Are you sure you want to delete the chat history?
cs: Tento krok nelze vrátit zpět. Určitě chceš vymazat chat?
sk: Tento krok nejde vrátiť späť. Určite chceš vymazať históriu chatu?

# chat.message.delete.confirm.back
source: Nope
cs: Ne
sk: Nie

# chat.message.delete.confirm.action
source: Yes, delete
cs: Ano, chci
sk: Áno, chcem

# chat.message.block.title
source: Block forever?
cs: Zablokovat napořád?
sk: Zablokovať navždy?

# chat.message.block.description
source: Do you really want to block this user? You will never be able to undo this action. Choose wisely.
cs: Opravdu chceš uživatele zablokovat? Tento krok nejde vrátit zpět. Dobře si to rozmysli.
sk: Naozaj chceš užívateľa zablokovať? Tento krok nejde vrátiť späť. Dobre si to rozmysli.

# chat.message.block.back
source: Nope
cs: Ne
sk: Nie

# chat.message.block.action
source: Yes, block
cs: Ano, chci
sk: Áno, chcem

# chat.message.block.confirm.title
source: You sure?
cs: Určitě?
sk: Naozaj?

# chat.message.block.confirm.description
source: Do you really want to block this user? You will never be able to undo this action. Choose wisely.
cs: Opravdu chceš uživatele zablokovat? Tento krok nejde vrátit zpět. Dobře si to rozmysli.
sk: Naozaj chceš užívateľa zablokovať? Tento krok nejde vrátiť späť. Dobre si to rozmysli.

# chat.message.block.confirm.back
source: Nope
cs: Ne
sk: Nie

# chat.message.block.confirm.action
source: Yes, block
cs: Ano, chci
sk: Áno, chcem

# chat.message.conversation.image
source: An image was shared
cs: Přišel ti obrázek
sk: Prišiel ti obrázok

# chat.message.conversation.request.accepted
source: The conversation has started
cs: Konverzace zahájena
sk: Konverzácia zahájená

# chat.message.identity.reveal.header
source: Identity reveal request
cs: Žádost o odhalení
sk: Žiadosť o odhalenie identity

# chat.message.identity.reveal.subheader
source: Let’s reveal our identities!
cs: Pojďme se odhalit!
sk: Poďme si odhaliť identity!

# chat.message.identity.reveal.request.sent
source: Identity reveal request sent
cs: Žádost o odhalení odeslána
sk: Žiadosť o odhalenie identity odoslaná

# chat.message.identity.reveal.request
source: Identity reveal request
cs: Žádost o odhalení
sk: Žiadosť o odhalenie identity

# chat.message.identity.reveal.pending
source: Pending...
cs: Čeká na odpověď...
sk: Čaká na odpoveď...

# chat.message.identity.reveal.pending.ok
source: Got it
cs: Rozumím!
sk: Rozumiem

# chat.message.identity.reveal.pending.button
source: Got it
sk: Rozumiem

# chat.message.identity.reveal.pending.tap
source: Tap to reveal or decline
cs: Odhal, nebo odmítni
sk: Klikni pre odhalenie identity alebo zamietnutie

# chat.message.identity.confirmation.title
source: Are you sure you want to reveal your identity?
cs: Určitě se chceš odhalit?
sk: Určite chceš odhaliť svoju identitu?

# chat.message.identity.confirmation.subtitle
source: If you reveal your identity you will see the identity of your counterparty too.
cs: Po odhalení se ti zobrazí i tvůj protějšek
sk: Po odhalení tvojej identity sa ti zobrazí aj identita tvojej protistrany.

# chat.message.identity.confirmation.yes
source: Yes
cs: Ano
sk: Áno

# chat.message.identity.confirmation.cancel
source: No
cs: Ne
sk: Nie

# chat.message.identity.request.title
source: Send identity reveal request
cs: Odeslat žádost o odhalení
sk: Poslať žiadosť o odhalenie identity

# chat.message.identity.request.subtitle
source: By sending an identity reveal request you agree to reveal your own identity too.
cs: Odesláním žádosti souhlasíš i se svým odhalením.
sk: Odesláním žádosti souhlasíš i se svým odhalením.

# chat.message.identity.request.send
source: Send request
cs: Odeslat žádost
sk: Odoslať žiadosť

# chat.message.identity.request.cancel
source: Back
cs: Zpět
sk: Späť

# chat.message.identity.reveal.reject.received
source: Your request has been declined.
sk: Tvoja žiadosť bola zamietnutá.

# chat.message.identity.reveal.reject
source: Identity reveal declined.
cs: Odmítnul jsi
sk: Zamítnul jsi žádost o odhalení tvé identity

# chat.message.identity.reveal.approved
source: Identity revealed!
cs: Identita odhalena!
sk: Identita odhalená!

# chat.message.identity.reveal.sent
source: Identity reveal request sent!
sk: Žiadosť o odhalenie identity odoslaná

# chat.message.copy.message
source: Copy message
sk: Skopírovať správu

# chat.message.copy.link
source: Copy link
sk: Skopírovať odkaz

# chat.message.open.link
source: Open link
sk: Otvoriť odkaz

# groups.join.button
source: Join new group
cs: Přidat se ke skupině
sk: Pridať sa k skupine

# groups.title
source: Groups
cs: Skupiny
sk: Skupiny

# groups.leave.button
source: Leave
cs: Odejít
sk: Opustiť skupinu

# groups.item.members
source: %@ members
cs: %@ členové
sk: %@ členovia

# groups.enter.camera.denied
source: Vexl needs permission to access the camera
sk: Vexl potrebuje prístup k fotoaparátu.

# groups.enter.camera.error
source: Vexl could not initialize the QR scanner
sk: Nepodarilo sa spustiť čítačku QR kódov.

# groups.enter.code
source: Enter code manually
cs: Vložit kód ručně
sk: Vložiť kód ručne

# groups.scan.code
source: Scan QR code to join a group
cs: Nascanovat QR pro připojení do skupiny
sk: Naskenovať QR pre pripojenie do skupiny

# groups.enter.code.description
source: Enter the activation code below.
cs: Vyplňte aktivační kód níže
sk: Vyplň aktivačný kód nižšie

# groups.leave.group.title
source: Leave group?
cs: Opustit skupinu?
sk: Opustiť skupinu?

# groups.leave.group.description
source: If you leave, you won’t be able to see its offers or chat with members.
cs: Nebudete si moci zobrazit nabídky a konverzace se členy skupiny
sk: Už si nebudeš môcť zobraziť ponuky z tejto skupiny.

# groups.leave.group.no
source: Nope
cs: Ne
sk: Nie

# groups.leave.group.yes
source: Yes, leave
cs: Ano, odejít
sk: Áno, odísť

# groups.join.title
source: Join %@ group?
cs: Chceš se připojit? %@
sk: Chceš sa pridať? %@

# groups.join.description
source: When you join %@ group, you’ll see offers from other participants.
cs: Po přidání uvidíš nabídky členů této skupiny.
sk: Po pridaní uvidíš ponuky členov tejto skupiny.

# groups.join.no
source: Nope
cs: Ne
sk: Nie

# groups.join.yes
source: Yes
cs: Ano
sk: Áno

# groups.scan.not.found
source: Group code not found
cs: Kód skupiny nenalezen
sk: Kód skupiny nenájdený

# groups.code.not.found
source: Invalid code
cs: Nesprávný kód
sk: Nesprávny kód

# groups.enter.code.hint
source: Activation code
cs: Aktivační kód
sk: Aktivačný kód

# offer.widget.groups
source: From %@ group
cs: Z %@ skupina
sk: Z %@ skupina

# offer.widget.groups.info
source: %@ offer
cs: %@ nabídka
sk: %@ ponuka

# faq.title
source: Frequently Asked Questions
sk: Často kladené otázky

# faq.scene1.title
source: What is Vexl?
sk: Čo je Vexl ?

# faq.scene1.description
source: Vexl is a platform where you can trade Bitcoin within your real world social network - your friends and friends of their friends - while staying completely anonymous - if you wish.
sk: Vexl je platforma kde môžeš dohadovať zmenu bitcoinu v rámci svojej reálnej sociálnej siete - so svojimi priateľmi a priateľmi ich priateľov - a pritom zostať úplne anonymný, pokiaľ si to praješ.

# faq.scene2.title
source: Who can see my contacts?
sk: Kto môže vidieť moje kontakty?

# faq.scene2.description
source: People whom you allow to see your identity can see the friends you have in common. That's it.
sk: Ľudia, ktorým dovolíš vidieť svoju identitu, môžu vidieť vaších spoločných priateľov. To je všetko.

# faq.scene3.title
source: How can I remain anonymous and still participate in Vexl?
sk: Ako môžem zostať anonymný a pritom byť súčasťou Vexlu?

# faq.scene3.description
source: By default, you participate in the network under your Vexl name and Vexl avatar that were given to you during the registration. You can only reveal your identity per a particular trade in our secure, end to end encrypted chat.
sk: Ostatní účastníci siete ťa uvidia pod tvojim Vexl menom a avatarom, ktoré ti boli pridelené pri registrácii. Svoju identitu môžeš odhaliť iba pre konkrétny obchod v našom zabezpečenom, end-to-end šifrovanom chate.

# faq.scene4.title
source: How can I make sure that the person I am talking to is the person I want to talk to?
sk: Ako sa môžem uistiť, že osoba, s ktorou sa bavím, je ta, s ktorou sa chcem baviť?

# faq.scene4.description
source: One challenge with truly anonymous communications systems like Vexl is that sometimes you do need to verify the identity of the person you’re talking to! In cases like these, it’s best to use a secure secondary channel of communication to confirm with the other person that you’re both who you say you are.
sk: Jedným z úskalí skutočne anonymných komunikačných systémov, ako je Vexl, je to, že si niekedy musíte overiť totožnosť osoby, s ktorou komunikujete! V takýchto prípadoch je najlepšie použiť zabezpečený sekundárny komunikačný kanál, aby si si s druhou osobou potvrdil, že ste obaja tí, za ktorých sa vydávate.

# faq.scene5.title
source: How can I ensure that my communication and trades are private and encrypted?
sk: Ako sa môžem uistiť, že moja komunikácia a obchody sú súkromné a šifrované?

# faq.scene5.description
source: Vexl is open source - anyone can look for any backdoors or any other malicious intention. Also, you can look at the report from an independent Security Audit .
cs: Vexl is open source - anyone can look for any backdoor or malicious intentions. Also, here you can look at the report from an independent Security Audit .
sk: Vexl má otvorený zdrojový kod - ktokoľvek v ňom môže hľadať zadné vrátka alebo škodlivé úmysly. Môžeš sa tiež pozrieť na správu z nezávislého bezpečnostného auditu.

# faq.scene6.title
source: How can you ensure that my data is protected?
sk: Ako môžete zaistiť ochranu mojich údajov?

# faq.scene6.description
source: Vexl is designed to never collect or store any sensitive information. Vexl messages and other content cannot be accessed by us or other third parties because they are always end-to-end encrypted, private, and secure. Our Terms of Service and Privacy Policy are available below.
sk: Vexl je navrhnutý tak, aby nikto nezhromažďoval ani neukládal žiadne citlivé informácie. K správam a ďalšiemu obsahu nemáme my ani iné tretie strany prístup, pretože sú vždy šifrované end-to-end. Naše podmienky poskytovania služieb a zásady ochrany osobných údajov sú k dispozícii nižšie.

# faq.scene7.title
source: How do I contact Vexl?
sk: Ako môžem kontaktovať Vexl ?

# faq.scene7.description
source: You can always reach out to us via email: support@vexl.it. For a private comms, you can also send us an e2ee mail. Or you can meet us during your next P2P trade! 😻
sk: Vždy sa na nás môžeš obrátiť prostredníctvom e-mailu: support@vexl.it. Alebo sa s nami môžeš stretnúť počas svojho budúceho P2P obchodu! 😻

# faq.scene7.description1
source: You can always reach out to us via email:
sk: Vždy sa na nás môžeš obrátiť prostredníctvom e-mailu:

# faq.scene7.description3
source: Or you can meet us during your next P2P trade! 😻
cs: For a private comms, you can also send us an e2ee mail. Or you can meet us during your next P2P trade! 😻
sk: Alebo sa s nami môžeš stretnúť počas svojho budúceho P2P obchodu! 😻

# permission.camera.denied
source: Camera permission denied
cs: Přístup ke kameře byl zakázán
sk: Prístup ku kamere bol odopretý

# locked.screen.title
source: We are currently growing our social network. Import your contacts and help us spread the word!
sk: V súčasnosti vytvárame sociálnu sieť. Importuj svoje kontakty a pomôž nám šířiť Vexl!

# locked.screen.subtitle
source: Have you already created your offer?
sk: Vytvoril si už svoju ponuku?

# locked.screen.sell
source: I'm selling
sk: Chcem predať

# locked.screen.buy
source: I'm buying
sk: Chcem kúpiť

# locked.screen.offers
source: Offer
sk: Ponuka

# locked.groups
source: Groups are locked right now
sk: Funkcia Skupiny je zamknutá.

# locked.screen.contacts.remaining
source: Contacts remaining
sk: Zostávajúcich kontaktov

# intro.skip
source: Skip
sk: Preskočiť

# intro.continue
source: Continue
sk: Pokračovať

# intro.first.title
source: Connect anonymously with your friends.
sk: Anonymne sa spoj so svojimi kontaktmi.

# intro.second.title
source: See buy & sell offers.
sk: Pozri sa na ich ponuky.

# intro.third.title
source: Start chatting, reveal identities and trade.
sk: Začnite chatovat,odhaľte svoje identity a obchodujte.

# error.user.is.blocked
source: User is blocked
sk: Užívateľ je zablokovaný

# error.unauthorized
source: Unauthorized error. You were logged out.
sk: Neoprávnená chyba. Bol si odhlásený.

# error.unknown.error.occurred
source: The action could not be completed because an unknown error occurred. Please try again later.
sk: Akciu nebolo možné dokončiť, protože došlo k neznámej chybe. Skús to neskôr znovu prosím.

# error.unknown.connection.problem
source: Connection problem. Please try again later.
sk: Problém s pripojením. Skús to neskôr znovu prosím.

# error.invalid.data.format
source: Invalid data format
sk: Neplatný formát dát

# user.passcode.initial.title
source: Setup your new passcode
sk: Nastav si nový prístupový kód

# user.passcode.initial.subtitle
source: Without passcode, nobody will be able to access your Vexl or Privacy Settings in app.
sk: Bez prístupového kódu nebude mať nikto prístup k nastaveniam Vexl alebo súkromia v aplikácii.

# user.passcode.confirm.title
source: Repeat your new passcode
sk: Zopakuj svoj nový prístupový kód

# user.passcode.confirm.subtitle
source: Without passcode, nobody will be able to access your Vexl or Privacy Settings in app.
sk: Bez prístupového kódu nebude mať nikto prístup k nastaveniam Vexl alebo súkromia v aplikácii.

# user.passcode.loader.one
source: Anonymizing your identity...
sk: Anonymizácia tvojej identity...

# user.passcode.loader.two
source: Anonymizing your contact list...
sk: Anonymizácia tvojho zoznamu kontaktov...

# user.passcode.loader.three
source: Securing your profile...
sk: Zabezpečenie tvojho profilu...

# user.passcode.input
source: Enter your passcode
sk: Zadaj prístupový kód

# user.passcode.error.invalid
source: Wrong passcode
sk: Zlý prístupový kód

# user.passcode.error.not.equal
source: Passcodes are not the same
sk: Prístupové kódy sa nezhodujú

# force.update.title
source: New version of Vexl available!
sk: Je dostupná nová verzia Vexlu!

# force.update.subtitle
source: Get the latest version of Vexl to ensure proper functionality.
sk: Pre správne fungovanie Vexlu je nutné aplikáciu aktualizovať.

# force.update.button
source: Update now
sk: Aktualizovať

# lock.maintenance.title
source: Marketplace maintenance
sk: Údržba marketplacu

# lock.maintenance.subtitle
source: Vexl app is in maintenance. Come back later, please.
sk: Aplikácia Vexl je v údržbe. Vráťte sa, prosím, neskôr.

# report.offer.modal.title
source: Report offer?
sk: Nahlásiť ponuku?

# report.offer.modal.subtitle
source: Do you really want to report this offer? You will never be able to undo this action. Choose wisley.
sk: Skutočne chcete nahlásiť túto ponuku? Táto akcia je nevratná.

# report.offer.modal.button.yes
source: Yes, report
sk: Ano, nahlásiť

# report.offer.modal.button.no
source: Nope
sk: Nie

# report.offer.confirmation.modal.title
source: Thank you!
sk: Vďaka!

# report.offer.confirmation.modal.subtitle
source: Inappropriate content was anonymously reported.
sk: Nevhodný obsah bol anonymne nahlásený.

# report.offer.confirmation.modal.button
source: Continue
sk: Pokračovať

# error.no.offer.id.found
source: Report offer failed. No offer with this ID found.
sk: Akcia zlyhala. ID tejto ponuky sa nenašlo.

# filter.title
source: Filter
cs: Filtr
